import Auditorium from "../../src/Auditorium";

const headers: HeadersInit = new Headers();
headers.set('Content-Type', 'application/json');

const mockResponse: Response = {
    text: () =>
      Promise.resolve(
        `[
            {
              "id": 1490350520895803600,
              "name": "901 Лаборатория растениеводства",
              "number": "901",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 0,
              "width": 0
            },
            {
              "id": 1490350520901046500,
              "name": "902 Учебно-методический кабинет",
              "number": "902",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6040,
              "width": 8620
            },
            {
              "id": 1490350520904192300,
              "name": "903 Компьютерный класс",
              "number": "903",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8650
            },
            {
              "id": 1490350520907338000,
              "name": "904 Компьютерный класс",
              "number": "904",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8620
            },
            {
              "id": 1490350520911532300,
              "name": "905 Учебная аудитория",
              "number": "905",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2500
            },
            {
              "id": 1490350520914678000,
              "name": "906 Учебная аудитория",
              "number": "906",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8840
            },
            {
              "id": 1490350520918872300,
              "name": "907 Учебная аудитория",
              "number": "907",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2810
            },
            {
              "id": 1490350520926212400,
              "name": "909 Кабинет развития творческих способностей ребенка, медиазал",
              "number": "909",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8680
            },
            {
              "id": 1490350520941941000,
              "name": "913 Учебная аудитория",
              "number": "913",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2470
            },
            {
              "id": 1490350520946135300,
              "name": "914 Учебная аудитория",
              "number": "914",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2480
            },
            {
              "id": 1490351134435447000,
              "name": "901а Гербарная кафедры биологии",
              "number": "901а",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 3060,
              "width": 2620
            },
            {
              "id": 1490351214364201200,
              "name": "901в Молодежный экологический центр каф.биологии",
              "number": "901в",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 3060,
              "width": 3850
            },
            {
              "id": 1490351349030719700,
              "name": "904а Лаборатория развития ребёнка кафедры ДО",
              "number": "904а",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 5500,
              "width": 2860
            },
            {
              "id": 1490351639742124300,
              "name": "909а Учебная аудитория",
              "number": "909а",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2750
            },
            {
              "id": 1671012842866741500,
              "name": "901г Учебная оранжерея",
              "number": "901г",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 4770,
              "width": 2950
            },
            {
              "id": 1492080913849258200,
              "name": "13 Лаборатория по архитектурному материаловедению",
              "number": "13",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 2600,
              "length": 12150,
              "width": 5990
            },
            {
              "id": 1492092945918071000,
              "name": "22 Лаборатория строительных конструкций и механики грунтов",
              "number": "22",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 2600,
              "length": 17670,
              "width": 5930
            },
            {
              "id": 1492153967635861800,
              "name": "12 Лаборатория механических испытаний",
              "number": "12",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 2600,
              "length": 11150,
              "width": 5790
            },
            {
              "id": 1492155177219658000,
              "name": "10 Лаборатория деформации и ползучести",
              "number": "10",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 2600,
              "length": 5780,
              "width": 6090
            },
            {
              "id": 1492155427871265000,
              "name": "8 Лаборатория бетонов",
              "number": "8",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 2600,
              "length": 10830,
              "width": 5760
            },
            {
              "id": 1492155483396510000,
              "name": "6 Лаборатория технологии бетонов",
              "number": "6",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 2600,
              "length": 12320,
              "width": 5850
            },
            {
              "id": 1700641814817403100,
              "name": "26 Лаборатория",
              "number": "26",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 2600,
              "length": 6350,
              "width": 5830
            },
            {
              "id": 1490352157716648200,
              "name": "103 Класс рисунка",
              "number": "103",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3660,
              "length": 5750,
              "width": 5520
            },
            {
              "id": 1490352157720842500,
              "name": "104 Компьютерный класс",
              "number": "104",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3660,
              "length": 5520,
              "width": 6120
            },
            {
              "id": 1490352157742862600,
              "name": "109 Лаборатория теплофизики",
              "number": "109",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3660,
              "length": 2870,
              "width": 5530
            },
            {
              "id": 1490352157750202600,
              "name": "111 Лаборатория строительных материалов",
              "number": "111",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3660,
              "length": 8820,
              "width": 5600
            },
            {
              "id": 1490352157760688400,
              "name": "113 Кабинет архитектурно-строительного проектирования",
              "number": "113",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3660,
              "length": 5970,
              "width": 5480
            },
            {
              "id": 1490353917944402200,
              "name": "200 Компьютерный класс",
              "number": "200",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 5750,
              "width": 6070
            },
            {
              "id": 1490353917950693600,
              "name": "201 Учебная аудитория",
              "number": "201",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 5660,
              "width": 5460
            },
            {
              "id": 1490353917954888000,
              "name": "202 Учебная аудитория",
              "number": "202",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 14200,
              "width": 5540
            },
            {
              "id": 1490353917971665200,
              "name": "206 Компьютерный класс, тестирование специалистов-строителей",
              "number": "206",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 8550,
              "width": 5520
            },
            {
              "id": 1490353917989491000,
              "name": "210 Компьютерный класс",
              "number": "210",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 8410,
              "width": 5470
            },
            {
              "id": 1490353918002073900,
              "name": "213 Компьютерный класс",
              "number": "213",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 8660,
              "width": 5310
            },
            {
              "id": 1490353918007316700,
              "name": "214 Аудитория",
              "number": "214",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 6120,
              "width": 5480
            },
            {
              "id": 1490353918015705300,
              "name": "216 Аудитория",
              "number": "216",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 5450,
              "width": 5480
            },
            {
              "id": 1490353918025142500,
              "name": "218 Аудитория",
              "number": "218",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 8660,
              "width": 5470
            },
            {
              "id": 1490353918029336800,
              "name": "219 Компьютерный класс",
              "number": "219",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 8700,
              "width": 5520
            },
            {
              "id": 1490353918039822600,
              "name": "221 Аудитория",
              "number": "221",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 8670,
              "width": 5550
            },
            {
              "id": 1492181318812832000,
              "name": "220а Аудитория",
              "number": "220а",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 3000,
              "width": 3460
            },
            {
              "id": 1490356052340773000,
              "name": "301 Учебная  аудитория",
              "number": "301",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8740,
              "width": 5510
            },
            {
              "id": 1490356052346016000,
              "name": "302 Компьютерный класс",
              "number": "302",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8680,
              "width": 5500
            },
            {
              "id": 1490356052350210300,
              "name": "303 Кабинет геологии",
              "number": "303",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8680,
              "width": 5520
            },
            {
              "id": 1490356052369084700,
              "name": "307 Класс живописи",
              "number": "307",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 5570,
              "width": 5550
            },
            {
              "id": 1490356052374327600,
              "name": "308 Лаборатория общей химической технологии и технологии НВ",
              "number": "308",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 11900,
              "width": 5490
            },
            {
              "id": 1490356052378521900,
              "name": "309 Кабинет для самостоятельной работы (магистры и аспиранты)",
              "number": "309",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 2680,
              "width": 5500
            },
            {
              "id": 1490356052383764700,
              "name": "310 Лаборатория инструментальных методов анализа",
              "number": "310",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 5870,
              "width": 5480
            },
            {
              "id": 1490356052387959000,
              "name": "311 Учебная аудитория",
              "number": "311",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 11770,
              "width": 5540
            },
            {
              "id": 1490356052393202000,
              "name": "312 Аудитория",
              "number": "312",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 17600,
              "width": 5520
            },
            {
              "id": 1490356052402639000,
              "name": "314 Учебная аудитория",
              "number": "314",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 17440,
              "width": 5510
            },
            {
              "id": 1490356052419416300,
              "name": "318 Учебная аудитория",
              "number": "318",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 5590,
              "width": 5500
            },
            {
              "id": 1490356052426756400,
              "name": "320 Макетная мастерская кафедры ДАС",
              "number": "320",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 2590,
              "width": 5470
            },
            {
              "id": 1490356052431999200,
              "name": "321 Методический кабинет магистерской подготовки",
              "number": "321",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 10480,
              "width": 2530
            },
            {
              "id": 1700649123946819800,
              "name": "Кабинет",
              "number": "316а",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 2640,
              "width": 5490
            },
            {
              "id": 1700649168941216000,
              "name": "Кабинет",
              "number": "316б",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 3210,
              "width": 5490
            },
            {
              "id": 1700649246347096300,
              "name": "Кабинет",
              "number": "320а",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 3050,
              "width": 5580
            },
            {
              "id": 1490364153819304200,
              "name": "401 Кабинет инженерной геодезии",
              "number": "401",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 14650,
              "width": 5460
            },
            {
              "id": 1490364153823498500,
              "name": "402 Компьютерный класс",
              "number": "402",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8660,
              "width": 5400
            },
            {
              "id": 1490364153830838500,
              "name": "404 Учебная аудитория",
              "number": "404",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 9110,
              "width": 5490
            },
            {
              "id": 1490364153835032800,
              "name": "405 Учебная аудитория",
              "number": "405",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 5680,
              "width": 5600
            },
            {
              "id": 1490364153842372900,
              "name": "407 Лаборатория химических, физических и физико-химических исследований",
              "number": "407",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8220,
              "width": 5500
            },
            {
              "id": 1490364153849713000,
              "name": "409 Лаборатория аналитической химии, ФХМА и идентификации веществ",
              "number": "409",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 9160,
              "width": 5500
            },
            {
              "id": 1490364153852858600,
              "name": "410 Лаборатория общей и неорганической химии",
              "number": "410",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8750,
              "width": 5550
            },
            {
              "id": 1490364153860198700,
              "name": "412 Лаборатория рентгеноструктурного анализа кафедры строительства им. В.С.Грызлова",
              "number": "412",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 6270,
              "width": 5500
            },
            {
              "id": 1490364153864393000,
              "name": "413 Северная аудитория",
              "number": "413",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 17530,
              "width": 5460
            },
            {
              "id": 1490364153868587300,
              "name": "414 Южная аудитория",
              "number": "414",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 17530,
              "width": 5460
            },
            {
              "id": 1490364153894801700,
              "name": "421 Лаборатория физической и коллоидной химии",
              "number": "421",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8720,
              "width": 5550
            },
            {
              "id": 1490364153897947400,
              "name": "422 Компьютерный класс, кабинет курсового и дипломного проектирования",
              "number": "422",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8820,
              "width": 5530
            },
            {
              "id": 1490364153909481700,
              "name": "425 Лаборатория ПАХТ, гидравлики и теплотехники",
              "number": "425",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8430,
              "width": 5480
            },
            {
              "id": 1492356729759863000,
              "name": "7 Лаборатория",
              "number": "7",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 1920,
              "length": 4540,
              "width": 5950
            },
            {
              "id": 1492356824990486800,
              "name": "10 Лаборатория",
              "number": "10",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 1920,
              "length": 10770,
              "width": 5900
            },
            {
              "id": 1490372472041640200,
              "name": "2а Лаборатория металлографических исследований",
              "number": "2а",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 6100,
              "width": 6000
            },
            {
              "id": 1490372523516236000,
              "name": "3а Лаборатория современного электропривода и мехатронных систем",
              "number": "3а",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 10750,
              "width": 6000
            },
            {
              "id": 1490372581715349800,
              "name": "3б Лаборатория моделирования и механических испытаний",
              "number": "3б",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 7550,
              "width": 2800
            },
            {
              "id": 1490372620801020200,
              "name": "3в Лаборатория робототехнических прокатных комплексов",
              "number": "3в",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 7350,
              "width": 5900
            },
            {
              "id": 1490372667269714200,
              "name": "16 Лаборатория гидравлики и гидропневмопривода",
              "number": "16",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 6700,
              "width": 5950
            },
            {
              "id": 1490372720714584300,
              "name": "16а Лаборатория электрометаллургии",
              "number": "16а",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 4500,
              "width": 2940
            },
            {
              "id": 1490372835492761900,
              "name": "17 Лаборатория материаловедения и ТКМ",
              "number": "17",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 10640,
              "width": 5960
            },
            {
              "id": 1490372835498004700,
              "name": "18 Лаборатория \"Подъемно-транспортные, строительные, дорожные машины и оборудование\"",
              "number": "18",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 10760,
              "width": 5960
            },
            {
              "id": 1700714690460381400,
              "name": "16а Лаборатория",
              "number": "16а",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 3760,
              "width": 5950
            },
            {
              "id": 1700714738897252600,
              "name": "24 Лаборатория",
              "number": "24",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 2950,
              "width": 2940
            },
            {
              "id": 1490435408621736200,
              "name": "21 Учебная аудитория",
              "number": "21",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3240,
              "length": 1079000,
              "width": 5950
            },
            {
              "id": 1490435408625930500,
              "name": "22 Лаборатория металлургической теплотехники",
              "number": "22",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3240,
              "length": 7048000,
              "width": 5940
            },
            {
              "id": 1490435408634319000,
              "name": "24 Компьютерный класс",
              "number": "24",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3240,
              "length": 7020,
              "width": 5960
            },
            {
              "id": 1490435408638513400,
              "name": "25 Проектная  аудитория",
              "number": "25",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3240,
              "length": 7040,
              "width": 5950
            },
            {
              "id": 1490435742868967700,
              "name": "27а Учебно-методический кабинет кафедры теплоэнергетики и теплотехники",
              "number": "27а",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3240,
              "length": 3520,
              "width": 5920
            },
            {
              "id": 1490435777622970600,
              "name": "27б Компьютерный класс",
              "number": "27б",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3240,
              "length": 7100,
              "width": 5920
            },
            {
              "id": 1490435838350201000,
              "name": "28 Компьютерный класс",
              "number": "28",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3240,
              "length": 3540,
              "width": 5960
            },
            {
              "id": 1490436122605523200,
              "name": "32 Компьютерный класс",
              "number": "32",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 7520,
              "width": 5960
            },
            {
              "id": 1490436122613911800,
              "name": "34 Учебно-методический кабинет кафедры ММиТО",
              "number": "34",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 3450,
              "width": 5940
            },
            {
              "id": 1490436122618106000,
              "name": "35 Учебная аудитория",
              "number": "35",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 13600,
              "width": 5940
            },
            {
              "id": 1490436183451242800,
              "name": "31а Учебно-методический кабинет каф.электроэнергетики и электротехники",
              "number": "31а",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 10810,
              "width": 5940
            },
            {
              "id": 1490436303758561500,
              "name": "35а Учебная аудитория",
              "number": "35а",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 7010,
              "width": 5930
            },
            {
              "id": 1490436425404911900,
              "name": "37  Лаборатория метрологии, стандартизации и сертификации",
              "number": "37",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 7200,
              "width": 2960
            },
            {
              "id": 1492619572869599500,
              "name": "31 Лаборатория  \"Schneider Electric\"",
              "number": "31",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 7160,
              "width": 2960
            },
            {
              "id": 1700718706692059400,
              "name": "Кабинет",
              "number": "11",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 6750,
              "width": 5940
            },
            {
              "id": 1490436480219222300,
              "name": "41 Лаборатория систем управления электроприводов",
              "number": "41",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 10780,
              "width": 5940
            },
            {
              "id": 1490436480224465200,
              "name": "42 Кабинет кристаллографии и минералогии",
              "number": "42",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 6950,
              "width": 5950
            },
            {
              "id": 1490436480234951000,
              "name": "44 Лаборатория металлургических технологий",
              "number": "44",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 7120,
              "width": 5930
            },
            {
              "id": 1490436480239145200,
              "name": "45 Компьютерный класс",
              "number": "45",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 10740,
              "width": 5920
            },
            {
              "id": 1490436480243339500,
              "name": "46 Учебно-методический кабинет каф.ТС и ТБ",
              "number": "46",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 3070,
              "width": 5920
            },
            {
              "id": 1490436480248582400,
              "name": "47 Учебная аудитория",
              "number": "47",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 10810,
              "width": 5930
            },
            {
              "id": 1490436480253825300,
              "name": "48 Лаборатория \"Машины непрерывного транспорта\"",
              "number": "48",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 10800,
              "width": 5940
            },
            {
              "id": 1490436903810371800,
              "name": "51 Учебная аудитория",
              "number": "51",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 10790,
              "width": 5950
            },
            {
              "id": 1490436903814566100,
              "name": "52 Лаборатория  теории механизмов и машин",
              "number": "52",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 10770,
              "width": 5940
            },
            {
              "id": 1490436903818760400,
              "name": "53  Кабинет промышленной безопасности",
              "number": "53",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 6700,
              "width": 5930
            },
            {
              "id": 1490436903822954800,
              "name": "54 Компьютерный класс",
              "number": "54",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 10480,
              "width": 5900
            },
            {
              "id": 1490436903827149000,
              "name": "55 Лаборатория  безопасности жизнедеятельности",
              "number": "55",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 10580,
              "width": 5930
            },
            {
              "id": 1490436903835537700,
              "name": "57 Лаборатория технической механики",
              "number": "57",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 10770,
              "width": 5920
            },
            {
              "id": 1490436903840780500,
              "name": "58 Лаборатория  « Конструкция и эксплутационные свойства трансп.машин»",
              "number": "58",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 10770,
              "width": 5930
            },
            {
              "id": 1490440174809649400,
              "name": "36 Аудитория",
              "number": "36",
              "buildName": "Учебно-лабораторный корпус № 8 (Советский пр., 25)",
              "buildId": 1490439577620452400,
              "height": 3500,
              "length": 7180,
              "width": 3530
            },
            {
              "id": 1490349048685662500,
              "name": "802 Учебная аудитория",
              "number": "802",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8720
            },
            {
              "id": 1490349048689856800,
              "name": "803 Компьютерный класс",
              "number": "803",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8740
            },
            {
              "id": 1490349048695099600,
              "name": "804 Учебно-методический ресурсный центр  кафедры ДО",
              "number": "804",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8670
            },
            {
              "id": 1490349048700342500,
              "name": "805 Учебная аудитория",
              "number": "805",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8900
            },
            {
              "id": 1490349048724459800,
              "name": "810 Учебная аудитория",
              "number": "810",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 11770
            },
            {
              "id": 1490349048728654000,
              "name": "811 Центр информационно-образовательных ресурсов",
              "number": "811",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8770
            },
            {
              "id": 1490349048733897000,
              "name": "812 Учебная аудитория",
              "number": "812",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8830
            },
            {
              "id": 1490349048748577000,
              "name": "815 Учебная аудитория",
              "number": "815",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5920,
              "width": 2650
            },
            {
              "id": 1490349048759062800,
              "name": "817 Учебная аудитория",
              "number": "817",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5920,
              "width": 2620
            },
            {
              "id": 1490349048763257000,
              "name": "818 Учебная аудитория",
              "number": "818",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5920,
              "width": 2570
            },
            {
              "id": 1490349048768500000,
              "name": "819 Учебная аудитория",
              "number": "819",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490349048772694300,
              "name": "820 Учебная аудитория",
              "number": "820",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 2740
            },
            {
              "id": 1490349048777937200,
              "name": "821 Учебная аудитория",
              "number": "821",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1490349048783180000,
              "name": "822 Учебная аудитория",
              "number": "822",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8820
            },
            {
              "id": 1490349048787374300,
              "name": "823 Учебная аудитория",
              "number": "823",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5970,
              "width": 3000
            },
            {
              "id": 1490349048791568600,
              "name": "824 Учебная аудитория",
              "number": "824",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8850
            },
            {
              "id": 1490349048795763000,
              "name": "825 Учебная аудитория",
              "number": "825",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8840
            },
            {
              "id": 1490349048799957200,
              "name": "826 Учебная аудитория",
              "number": "826",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490349048805200100,
              "name": "827 Компьютерный класс",
              "number": "827",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490349048808345900,
              "name": "828 Учебная аудитория",
              "number": "828",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8830
            },
            {
              "id": 1490349048812540200,
              "name": "829 Учебная аудитория",
              "number": "829",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1490349048817783000,
              "name": "830 Учебная аудитория",
              "number": "830",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 3770
            },
            {
              "id": 1671133117620949200,
              "name": "спортивный комплекс №1",
              "number": "1",
              "buildName": "Спортивный комплекс \"Университетский\" (ул. Труда, 3)",
              "buildId": 1490442417495610400,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1490347923942150400,
              "name": "702 Учебная аудитория",
              "number": "702",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8740
            },
            {
              "id": 1490347923946344700,
              "name": "703 Учебная аудитория",
              "number": "703",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2850
            },
            {
              "id": 1490347923949490400,
              "name": "704 Кабинет диалектологии и краеведения",
              "number": "704",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2850
            },
            {
              "id": 1490347923953684700,
              "name": "705 Учебно-методический кабинет кафедры ОФиПК",
              "number": "705",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8720
            },
            {
              "id": 1490347923956830500,
              "name": "706 Учебная аудитория",
              "number": "706",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8680
            },
            {
              "id": 1490347923959976200,
              "name": "707 Учебная аудитория",
              "number": "707",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8830
            },
            {
              "id": 1490347923964170500,
              "name": "708 Учебная аудитория",
              "number": "708",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2900
            },
            {
              "id": 1490347923979899100,
              "name": "712 Учебно-методический кабинет кафедры ГФиМК",
              "number": "712",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8770
            },
            {
              "id": 1490347923984093400,
              "name": "713 Учебная аудитория",
              "number": "713",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8830
            },
            {
              "id": 1490347924001919200,
              "name": "717 Лаборатория анатомии и физиологии человека",
              "number": "717",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8830
            },
            {
              "id": 1490347924006113500,
              "name": "718 Лаборатория биохимии и физиологии растений и микроорганизмов",
              "number": "718",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490347924011356400,
              "name": "719 Кабинет тактико-специальной  (специальной профессиональной) подготовки",
              "number": "719",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 11720
            },
            {
              "id": 1490347924016599300,
              "name": "720 Учебно-методический кабинет, учебно-методический ресурсный центр              кафедры НООиСП",
              "number": "720",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 9080
            },
            {
              "id": 1490347924020793600,
              "name": "721 Лаборатория ботаники",
              "number": "721",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1490347924050153700,
              "name": "723 Лаборатория зоологии",
              "number": "723",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8780
            },
            {
              "id": 1490347924055396600,
              "name": "724 Учебная аудитория",
              "number": "724",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 11750
            },
            {
              "id": 1490347924065882400,
              "name": "726 Лаборатория экологии",
              "number": "726",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1490347924070076700,
              "name": "727 Учебно-исследовательская лаборатория, преподавательская",
              "number": "727",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8860
            },
            {
              "id": 1490347924074271000,
              "name": "728 Учебно-методический кабинет кафедры биологии",
              "number": "728",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 3840
            },
            {
              "id": 1492794207908139300,
              "name": "214",
              "number": "214",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492794930937991400,
              "name": "215",
              "number": "215",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492794967740911900,
              "name": "216",
              "number": "216",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492795087890944300,
              "name": "217",
              "number": "217",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492795821227250000,
              "name": "204",
              "number": "204",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492795861098303700,
              "name": "205",
              "number": "205",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492795893434290400,
              "name": "206",
              "number": "206",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492795937044566300,
              "name": "207",
              "number": "207",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492796047880098000,
              "name": "208",
              "number": "208",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492796084514197800,
              "name": "209",
              "number": "209",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492796129310413000,
              "name": "210",
              "number": "210",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492796238597198000,
              "name": "211",
              "number": "211",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492805034838069500,
              "name": "310",
              "number": "310",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808120650436900,
              "name": "311",
              "number": "311",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808159299899600,
              "name": "312",
              "number": "312",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808193797001500,
              "name": "313",
              "number": "313",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808229907861800,
              "name": "314",
              "number": "314",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808265224950000,
              "name": "315",
              "number": "315",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808751372046600,
              "name": "303",
              "number": "303",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808787211325700,
              "name": "304",
              "number": "304",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808821804896500,
              "name": "305",
              "number": "305",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808858948604200,
              "name": "306",
              "number": "306",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808892042711300,
              "name": "307",
              "number": "307",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1490346292918882600,
              "name": "603 Учебно-методический кабинет",
              "number": "603",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490346292923076900,
              "name": "604 Класс психологического консультирования",
              "number": "604",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490346292930417000,
              "name": "606 Учебный класс для проведения психологических тренингов",
              "number": "606",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 5700
            },
            {
              "id": 1490346292933562600,
              "name": "607 Учебная аудитория",
              "number": "607",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 6120
            },
            {
              "id": 1490346292937757000,
              "name": "608 Класс психодиагностики. Специализированный компьютерный класс",
              "number": "608",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8750
            },
            {
              "id": 1490346292948242700,
              "name": "611 Компьютерный класс, лингафонный кабинет",
              "number": "611",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8900
            },
            {
              "id": 1490346292951388400,
              "name": "612 Учебная аудитория",
              "number": "612",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2900
            },
            {
              "id": 1490346292955582700,
              "name": "613 Кабинет физики",
              "number": "613",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8870
            },
            {
              "id": 1490346292966068500,
              "name": "614 Компьютерный класс",
              "number": "614",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1490346292969214200,
              "name": "615 Лаборатория информатики, технологий и методов программирования",
              "number": "615",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8680
            },
            {
              "id": 1490346292973408500,
              "name": "616 Учебная аудитория. Компьютерный класс",
              "number": "616",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1490346292984942800,
              "name": "619 Учебная аудитория. Компьютерный класс",
              "number": "619",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 9150
            },
            {
              "id": 1490346293000671500,
              "name": "621 Кабинет для самостоятельной работы",
              "number": "621",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2850
            },
            {
              "id": 1490346293006963000,
              "name": "622 Кабинет профилактического обслуживания оборудования",
              "number": "622",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2860
            },
            {
              "id": 1490346293012205800,
              "name": "623 Лаборатория электротехники, электроники и схемотехники. Лаборатория технической защиты информации.",
              "number": "623",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 11900
            },
            {
              "id": 1490346293016400100,
              "name": "624 Исследовательская лаборатория",
              "number": "624",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 3090
            },
            {
              "id": 1490346293021643000,
              "name": "625 Лаборатория сетей и системы защиты информации",
              "number": "625",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8670
            },
            {
              "id": 1490346293025837300,
              "name": "626 Лаборатория программно-аппаратных средств",
              "number": "626",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8880
            },
            {
              "id": 1490346293031080200,
              "name": "627 Учебная аудитория",
              "number": "627",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 5980,
              "width": 2880
            },
            {
              "id": 1490346293036323000,
              "name": "628 Учебная аудитория",
              "number": "628",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8760
            },
            {
              "id": 1492720435982242000,
              "name": "б/н Студенческий инженерный центр по проектированию и изготовлению инновационных скоростных транспортных средств",
              "number": "б/н  территория уч.корпуса №8",
              "buildName": "Гаражи для спецмашин - учебная лаборатория диагностики автотранспорта 1 (Сов. 25)",
              "buildId": 1492634331675366400,
              "height": 2110,
              "length": 11670,
              "width": 5710
            },
            {
              "id": 1493343626573386000,
              "name": "Спортзал",
              "number": "1/4",
              "buildName": "Спортивный корпус (ул.Труда,д.3)",
              "buildId": 1492901605554525200,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1493343766850834700,
              "name": "Кабинет",
              "number": "1/6",
              "buildName": "Спортивный корпус (ул.Труда,д.3)",
              "buildId": 1492901605554525200,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1493447465095926000,
              "name": "Спортзал",
              "number": "8",
              "buildName": "Стрелковый тир (ул.Труда, д.3)",
              "buildId": 1492901989869163500,
              "height": 3200,
              "length": 6000,
              "width": 10080
            },
            {
              "id": 1493448027080233200,
              "name": "11 Учебно-методический кабинет",
              "number": "11",
              "buildName": "Стрелковый тир (ул.Труда, д.3)",
              "buildId": 1492901989869163500,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1493448447601152300,
              "name": "Спортзал",
              "number": "24",
              "buildName": "Стрелковый тир (ул.Труда, д.3)",
              "buildId": 1492901989869163500,
              "height": 3200,
              "length": 13530,
              "width": 5980
            },
            {
              "id": 1493448489813676300,
              "name": "Спортзал",
              "number": "25",
              "buildName": "Стрелковый тир (ул.Труда, д.3)",
              "buildId": 1492901989869163500,
              "height": 3200,
              "length": 16050,
              "width": 12300
            },
            {
              "id": 1493515861911146800,
              "name": "Спортзал",
              "number": "14",
              "buildName": "Спортивный комплекс \"Университетский\" (ул.Труда, д.3)",
              "buildId": 1492902731193521200,
              "height": 8340,
              "length": 42360,
              "width": 18370
            },
            {
              "id": 1490345253992927500,
              "name": "502 Лаборатория социологических исследований",
              "number": "502",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490345253998170400,
              "name": "503 Учебно-методический кабинет каф.социологии и соц.технологий",
              "number": "503",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490345254003413200,
              "name": "504 Компьютерный класс",
              "number": "504",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8730
            },
            {
              "id": 1490345254013899000,
              "name": "506 Учебная аудитория",
              "number": "506",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 6160
            },
            {
              "id": 1490345254019142000,
              "name": "507 Учебная аудитория",
              "number": "507",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 6160
            },
            {
              "id": 1490345254028579000,
              "name": "509 Учебная аудитория",
              "number": "509",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8850
            },
            {
              "id": 1490345254033822000,
              "name": "510 Кабинет огневой подготовки",
              "number": "510",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8830
            },
            {
              "id": 1490345254038016300,
              "name": "511  Учебно-методический кабинет кафедры иностранных языков, преподавательская",
              "number": "511",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5720,
              "width": 6000
            },
            {
              "id": 1490345254043259100,
              "name": "512 Лаборатория молекулярной физики",
              "number": "512",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8880
            },
            {
              "id": 1490345254047453400,
              "name": "513 Учебная аудитория",
              "number": "513",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1490345254052696300,
              "name": "514 Учебная аудитория",
              "number": "514",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8650
            },
            {
              "id": 1490345254056890600,
              "name": "515 Лаборатория механики",
              "number": "515",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8820
            },
            {
              "id": 1490345254066327800,
              "name": "517 Лаборатория  физики",
              "number": "517",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8900
            },
            {
              "id": 1490345254075765000,
              "name": "519 Учебная аудитория",
              "number": "519",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 5830
            },
            {
              "id": 1490345254079959300,
              "name": "520 Учебная аудитория",
              "number": "520",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5950,
              "width": 11920
            },
            {
              "id": 1490345254090445000,
              "name": "522 Компьютерный класс",
              "number": "522",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5950,
              "width": 8920
            },
            {
              "id": 1490345254094639400,
              "name": "523 Учебно-методический кабинет КФС",
              "number": "523",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5980,
              "width": 2870
            },
            {
              "id": 1490345254099882200,
              "name": "524 Учебная аудитория",
              "number": "524",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5950,
              "width": 8880
            },
            {
              "id": 1490345254110368000,
              "name": "526 Лаборатория нанотехнологий",
              "number": "526",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5950,
              "width": 8770
            },
            {
              "id": 1671012713497629000,
              "name": "501б Проектная аудитория",
              "number": "501б",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 12020
            },
            {
              "id": 1488379776402985200,
              "name": "401 Учебно-методический кабинет кафедры ПиТО, зав.кафедрой",
              "number": "401",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6020,
              "width": 6190
            },
            {
              "id": 1488379776407179500,
              "name": "402 Учебная аудитория. Компьютерный класс",
              "number": "402",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 14700
            },
            {
              "id": 1488379776413471000,
              "name": "404 Лаборатория механики и художественной обработки материалов",
              "number": "404",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8680
            },
            {
              "id": 1488379776416616700,
              "name": "405 Лаборатория материаловедения и технологии обработки материалов",
              "number": "405",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8830
            },
            {
              "id": 1488379776422908200,
              "name": "407 Компьютерный класс",
              "number": "407",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 9080
            },
            {
              "id": 1488379776429199600,
              "name": "409 Учебная аудитория",
              "number": "409",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8880
            },
            {
              "id": 1488379776432345300,
              "name": "410 Учебная аудитория",
              "number": "410",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 8780,
              "width": 6000
            },
            {
              "id": 1488379776435491000,
              "name": "411 Лаборатория радиофизики",
              "number": "411",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8880
            },
            {
              "id": 1488379776438636800,
              "name": "412 Лаборатория физической электроники",
              "number": "412",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1488379776441782500,
              "name": "413 Лаборатория электричества и магнетизма",
              "number": "413",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8680
            },
            {
              "id": 1488379776444928300,
              "name": "414 Учебная аудитория",
              "number": "414",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 11750
            },
            {
              "id": 1488379776448074000,
              "name": "415 Учебный зал судебных заседаний",
              "number": "415",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 12150
            },
            {
              "id": 1488379776451219700,
              "name": "416 Компьютерный класс",
              "number": "416",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 5970,
              "width": 8830
            },
            {
              "id": 1488379776462754000,
              "name": "418 Компьютерный класс",
              "number": "418",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8920
            },
            {
              "id": 1488379776466948400,
              "name": "419 Лаборатория квантовой радиофизики",
              "number": "419",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2900
            },
            {
              "id": 1488379776470094000,
              "name": "420 Лаборатория оптики",
              "number": "420",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1488379776473239800,
              "name": "421 Лаборатория оптики",
              "number": "421",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1488379776483725600,
              "name": "424 Компьютерный класс",
              "number": "424",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8770
            },
            {
              "id": 1492166541423153400,
              "name": "114 Эколого-аналитическая лаборатория",
              "number": "114",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 0,
              "width": 0
            },
            {
              "id": 1488372624594571500,
              "name": "310 Учебно-методический кабинет",
              "number": "310",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 5970,
              "width": 2700
            },
            {
              "id": 1488372624604008700,
              "name": "312 Учебно-методический кабинет",
              "number": "312",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 5970,
              "width": 2800
            },
            {
              "id": 1488372624613446000,
              "name": "315 Учебная аудитория",
              "number": "315",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 2930
            },
            {
              "id": 1488372624626028800,
              "name": "319 Компьютерный класс, лингафонный кабинет, медиазал",
              "number": "319",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 8920
            },
            {
              "id": 1488372624631271700,
              "name": "320 Компьютерный класс",
              "number": "320",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 8730
            },
            {
              "id": 1488372624634417400,
              "name": "321 Кабинет предметно-методической подготовки и декоративно-прикладного искусства",
              "number": "321",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 8720
            },
            {
              "id": 1488372624637563100,
              "name": "322 Компьютерный класс",
              "number": "322",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 8710
            },
            {
              "id": 1488372624640708900,
              "name": "323 Учебно-методический ресурсный центр",
              "number": "323",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 2850
            },
            {
              "id": 1488372624643854600,
              "name": "324 Кабинет  графики, композиции, рисунка и живописи",
              "number": "324",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 12120
            },
            {
              "id": 1488372624649097500,
              "name": "325 компьютерный класс",
              "number": "325",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 5940,
              "width": 8830
            },
            {
              "id": 1488372624656437500,
              "name": "327а Компьютерный класс",
              "number": "327а",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 5800
            },
            {
              "id": 1488372624659583200,
              "name": "328 Лаборатория  интеллектуальных систем и датчиков",
              "number": "328",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 11550
            },
            {
              "id": 1488372624670069000,
              "name": "331 Учебная аудитория",
              "number": "331",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 11800
            },
            {
              "id": 1488379290380669200,
              "name": "327б Лаборатория технических средств автоматизации",
              "number": "327б",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 5890
            },
            {
              "id": 1492080565002703000,
              "name": "318 Медиа-лаборатория",
              "number": "318",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 5860
            },
            {
              "id": 1492089330440606000,
              "name": "302 Проектная аудитория",
              "number": "302",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6020,
              "width": 5820
            },
            {
              "id": 1671012457577976000,
              "name": "301а Проектная аудитория",
              "number": "301а",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6020,
              "width": 6000
            },
            {
              "id": 1671012499597562000,
              "name": "301б Проектная аудитория",
              "number": "301б",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6020,
              "width": 6000
            },
            {
              "id": 1671012553029849300,
              "name": "301в  Проектная аудитория",
              "number": "301в",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6040,
              "width": 3030
            },
            {
              "id": 1671012604089209000,
              "name": "301г Проектная аудитория",
              "number": "301г",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6020,
              "width": 3180
            },
            {
              "id": 1488365888710119700,
              "name": "201 Учебная аудитория",
              "number": "201",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 11620,
              "width": 12080
            },
            {
              "id": 1488365888715362600,
              "name": "202 Учебная аудитория",
              "number": "202",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 11750,
              "width": 11630
            },
            {
              "id": 1488365888719556900,
              "name": "203 Учебная аудитория",
              "number": "203",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 11830,
              "width": 11630
            },
            {
              "id": 1488365888722702600,
              "name": "204 Учебная аудитория",
              "number": "204",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 11630,
              "width": 11700
            },
            {
              "id": 1488365888726897000,
              "name": "205 Учебная  аудитория",
              "number": "205",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 11630,
              "width": 12000
            },
            {
              "id": 1488366378592244000,
              "name": "212 Лаборатория микроэлектроники и схемотехники  ЭВМ",
              "number": "212",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 8050,
              "width": 5600
            },
            {
              "id": 1488366378618458400,
              "name": "215 Учебно-методический кабинет кафедры МПО ЭВМ",
              "number": "215",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 2930,
              "width": 6000
            },
            {
              "id": 1488366378633138400,
              "name": "217 Компьютерный класс",
              "number": "217",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8750
            },
            {
              "id": 1488366378640478500,
              "name": "218 Компьютерный класс",
              "number": "218",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8730
            },
            {
              "id": 1488366378649915600,
              "name": "219 Компьютерный класс",
              "number": "219",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1488366378664595700,
              "name": "221 Учебная аудитория, компьютерный класс",
              "number": "221",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 12120
            },
            {
              "id": 1488366378671935700,
              "name": "222 Лаборатория рентгеноструктурного анализа им.Н.А.Ёрохова",
              "number": "222",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 5900,
              "width": 5960
            },
            {
              "id": 1488366378679275800,
              "name": "223 Лаборатория физики атомного ядра",
              "number": "223",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 0,
              "width": 8900
            },
            {
              "id": 1488366378695004400,
              "name": "225 Лаборатория оптических методов исследования твердого тела",
              "number": "225",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2900
            },
            {
              "id": 1488366378702344400,
              "name": "226 Лаборатория физики металлического состояния",
              "number": "226",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2860
            },
            {
              "id": 1488366378709684500,
              "name": "227 Лаборатория мобильных программных систем и технологий",
              "number": "227",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8840
            },
            {
              "id": 1488366378724364500,
              "name": "228 Лаборатория Multi- D моделирования.Лаборатория распределенных и высокопроизводительных вычислительных систем",
              "number": "228",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8820
            },
            {
              "id": 1488366378744287500,
              "name": "229 Компьютерный класс",
              "number": "229",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8880
            },
            {
              "id": 1488366378767356200,
              "name": "231 Лаборатория систем искусственного интеллекта",
              "number": "231",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 0,
              "width": 0
            },
            {
              "id": 1488369326572441900,
              "name": "218а Компьютерный класс",
              "number": "218а",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6460,
              "width": 5600
            },
            {
              "id": 1492072375260287200,
              "name": "111 Лаборатория нестерильной пробоподготовки",
              "number": "111",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 0,
              "width": 0
            },
            {
              "id": 1487105832995787000,
              "name": "105 лаборатория атомно-абсорбционной спектрометрии",
              "number": "105",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 3050
            },
            {
              "id": 1487105833005224200,
              "name": "108 Палеонтологическая лаборатория",
              "number": "108",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6020,
              "width": 17670
            },
            {
              "id": 1487105833010467000,
              "name": "110 Лаборатория IRMS",
              "number": "110",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 6860
            },
            {
              "id": 1492000351771955500,
              "name": "100 Лаборатория психофизиологии",
              "number": "100",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 2950,
              "width": 2500
            },
            {
              "id": 1743837688974143700,
              "name": "109 Лаборатория прикладной биотехнологии",
              "number": "109",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1490441475689812200,
              "name": "201 Инжиниринговый центр компьютерного моделирования",
              "number": "201",
              "buildName": "Учебно-лабораторный корпус № 5 (Луначарского, 5А)",
              "buildId": 1471886587531891700,
              "height": 3800,
              "length": 10910,
              "width": 6260
            },
            {
              "id": 1490441475706589400,
              "name": "203 Исследовательский центр искусственного  интеллекта и андроидной педагогики",
              "number": "203",
              "buildName": "Учебно-лабораторный корпус № 5 (Луначарского, 5А)",
              "buildId": 1471886587531891700,
              "height": 3800,
              "length": 10540,
              "width": 6340
            },
            {
              "id": 1490441475713929500,
              "name": "204 СКБ \"Мир\"",
              "number": "204",
              "buildName": "Учебно-лабораторный корпус № 5 (Луначарского, 5А)",
              "buildId": 1471886587531891700,
              "height": 3800,
              "length": 14100,
              "width": 6340
            },
            {
              "id": 1490441117992227000,
              "name": "101 Производственная лаборатория",
              "number": "101",
              "buildName": "Учебно-лабораторный корпус № 5 (Луначарского, 5А)",
              "buildId": 1471886587531891700,
              "height": 3620,
              "length": 10900,
              "width": 6290
            },
            {
              "id": 1490441118002712800,
              "name": "103 Конференц-зал",
              "number": "103",
              "buildName": "Учебно-лабораторный корпус № 5 (Луначарского, 5А)",
              "buildId": 1471886587531891700,
              "height": 3620,
              "length": 10560,
              "width": 6400
            },
            {
              "id": 1490441118038364400,
              "name": "109 Инжиниринговый центр автоматики и промышленной робототехники",
              "number": "109",
              "buildName": "Учебно-лабораторный корпус № 5 (Луначарского, 5А)",
              "buildId": 1471886587531891700,
              "height": 3620,
              "length": 7200,
              "width": 6270
            },
            {
              "id": 1491982414359040300,
              "name": "306 Репитиционный класс",
              "number": "306",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3400,
              "length": 5940,
              "width": 10950
            },
            {
              "id": 1490443018157691100,
              "name": "203 Учебная аудитория",
              "number": "203",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3200,
              "length": 5780,
              "width": 10570
            },
            {
              "id": 1490443092904382700,
              "name": "205  Конференц-зал",
              "number": "205",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3200,
              "length": 5860,
              "width": 11910
            },
            {
              "id": 1490443139895267600,
              "name": "216 Брекаут",
              "number": "216",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3200,
              "length": 7920,
              "width": 5820
            },
            {
              "id": 1490443179404562700,
              "name": "217 Брекаут",
              "number": "217",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3200,
              "length": 7970,
              "width": 5820
            },
            {
              "id": 1491718599420678400,
              "name": "207 Служба комплексной безопасности",
              "number": "207",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3200,
              "length": 5900,
              "width": 2550
            },
            {
              "id": 1491721535614882000,
              "name": "215 Брекаут",
              "number": "215",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3200,
              "length": 8000,
              "width": 5840
            },
            {
              "id": 1490442947335819500,
              "name": "101 Учебная аудитория. Студенческий пресс-центр",
              "number": "101",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3400,
              "length": 5820,
              "width": 9000
            },
            {
              "id": 1491703540390826200,
              "name": "118 Абонемент",
              "number": "118",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3400,
              "length": 5870,
              "width": 19320
            },
            {
              "id": 1490439059959452000,
              "name": "401 Компьютерный класс",
              "number": "401",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3200,
              "length": 11490,
              "width": 6020
            },
            {
              "id": 1490439059985666300,
              "name": "407 Кабинет магистерской подготовки",
              "number": "407",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3200,
              "length": 4930,
              "width": 6080
            },
            {
              "id": 1490439059993006300,
              "name": "409 Учебная аудитория",
              "number": "409",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3200,
              "length": 8280,
              "width": 6040
            },
            {
              "id": 1490439060005589200,
              "name": "412 Компьютерный класс",
              "number": "412",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3200,
              "length": 11410,
              "width": 6210
            },
            {
              "id": 1490438777520263400,
              "name": "301 Учебная аудитория, компьютерный класс",
              "number": "301",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3000,
              "length": 11450,
              "width": 6020
            },
            {
              "id": 1490438777526555000,
              "name": "302 Учебная аудитория, кабинет медико-биологических дисциплин",
              "number": "302",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3000,
              "length": 5840,
              "width": 5990
            },
            {
              "id": 1490438777530749200,
              "name": "303 Лаборатория",
              "number": "303",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3000,
              "length": 2280,
              "width": 6050
            },
            {
              "id": 1490438777542283500,
              "name": "306 Учебная аудитория",
              "number": "306",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3000,
              "length": 5510,
              "width": 6060
            },
            {
              "id": 1490438777550672100,
              "name": "308 Учебная аудитория",
              "number": "308",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3000,
              "length": 8030,
              "width": 6100
            },
            {
              "id": 1490438777561158000,
              "name": "311 Учебная аудитория",
              "number": "311",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3000,
              "length": 11370,
              "width": 6260
            },
            {
              "id": 1471774257598959900,
              "name": "201 Лаборатория финансовых вычислений",
              "number": "201",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3050,
              "length": 11430,
              "width": 6050
            },
            {
              "id": 1490437674469691600,
              "name": "202 Учебная аудитория",
              "number": "202",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3050,
              "length": 8210,
              "width": 5950
            },
            {
              "id": 1490437674475983000,
              "name": "203 Учебная аудитория",
              "number": "203",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3050,
              "length": 8230,
              "width": 5990
            },
            {
              "id": 1490437674480177400,
              "name": "204 Учебная аудитория",
              "number": "204",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3050,
              "length": 8090,
              "width": 6040
            },
            {
              "id": 1490437674499051800,
              "name": "208 Центр деловых игр",
              "number": "208",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3050,
              "length": 11410,
              "width": 6230
            },
            {
              "id": 1490437243326697700,
              "name": "102 РУМЦ СЗФО ЧГУ. Call-центр. Центр специальных технических средств обучения.",
              "number": "102",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3100,
              "length": 9440,
              "width": 6000
            },
            {
              "id": 1490437243336135000,
              "name": "104 Учебная аудитория",
              "number": "104",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3100,
              "length": 8150,
              "width": 6060
            },
            {
              "id": 1490437243340329200,
              "name": "105 Конференц-зал",
              "number": "105",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3100,
              "length": 16510,
              "width": 6050
            },
            {
              "id": 1490437243353960700,
              "name": "108 Учебная аудитория. Медиазал.",
              "number": "108",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3100,
              "length": 11430,
              "width": 6240
            },
            {
              "id": 1490437304943120600,
              "name": "101а Лаборатория функциональной диагностики и реабилитации РУМЦ СЗФО ЧГУ",
              "number": "101а",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3270,
              "length": 5800,
              "width": 5500
            },
            {
              "id": 1492811258034917600,
              "name": "Бассейн",
              "number": "15",
              "buildName": "Спортивно-оздоровительный комплекс (ул.Чкалова, 31А)",
              "buildId": 1491457877710214100,
              "height": 3100,
              "length": 0,
              "width": 10470
            },
            {
              "id": 1492811819195044000,
              "name": "Спортзал",
              "number": "25",
              "buildName": "Спортивно-оздоровительный комплекс (ул.Чкалова, 31А)",
              "buildId": 1491457877710214100,
              "height": 6800,
              "length": 23460,
              "width": 11560
            }
          ]`,
      ),
    headers: headers,
    ok: true,
    redirected: false,
    status: 200,
    statusText: 'Ok',
    type: 'default',
    url: 'testURL',
    clone: () => {
      return mockResponse
    },
    body: null,
    bodyUsed: true,
    arrayBuffer: () =>
      new Promise<ArrayBuffer>((resolve) => {
        resolve(new ArrayBuffer(8))
      }),
    blob: () =>
      new Promise<Blob>((resolve) => {
        resolve(new Blob())
      }),
    formData: () =>
      new Promise<FormData>((resolve) => {
        let f: FormData = new FormData()
        resolve(f)
      }),
    json: () => Promise.resolve(
        [
            {
              "id": 1490350520895803600,
              "name": "901 Лаборатория растениеводства",
              "number": "901",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 0,
              "width": 0
            },
            {
              "id": 1490350520901046500,
              "name": "902 Учебно-методический кабинет",
              "number": "902",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6040,
              "width": 8620
            },
            {
              "id": 1490350520904192300,
              "name": "903 Компьютерный класс",
              "number": "903",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8650
            },
            {
              "id": 1490350520907338000,
              "name": "904 Компьютерный класс",
              "number": "904",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8620
            },
            {
              "id": 1490350520911532300,
              "name": "905 Учебная аудитория",
              "number": "905",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2500
            },
            {
              "id": 1490350520914678000,
              "name": "906 Учебная аудитория",
              "number": "906",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8840
            },
            {
              "id": 1490350520918872300,
              "name": "907 Учебная аудитория",
              "number": "907",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2810
            },
            {
              "id": 1490350520926212400,
              "name": "909 Кабинет развития творческих способностей ребенка, медиазал",
              "number": "909",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8680
            },
            {
              "id": 1490350520941941000,
              "name": "913 Учебная аудитория",
              "number": "913",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2470
            },
            {
              "id": 1490350520946135300,
              "name": "914 Учебная аудитория",
              "number": "914",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2480
            },
            {
              "id": 1490351134435447000,
              "name": "901а Гербарная кафедры биологии",
              "number": "901а",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 3060,
              "width": 2620
            },
            {
              "id": 1490351214364201200,
              "name": "901в Молодежный экологический центр каф.биологии",
              "number": "901в",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 3060,
              "width": 3850
            },
            {
              "id": 1490351349030719700,
              "name": "904а Лаборатория развития ребёнка кафедры ДО",
              "number": "904а",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 5500,
              "width": 2860
            },
            {
              "id": 1490351639742124300,
              "name": "909а Учебная аудитория",
              "number": "909а",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2750
            },
            {
              "id": 1671012842866741500,
              "name": "901г Учебная оранжерея",
              "number": "901г",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 4770,
              "width": 2950
            },
            {
              "id": 1492080913849258200,
              "name": "13 Лаборатория по архитектурному материаловедению",
              "number": "13",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 2600,
              "length": 12150,
              "width": 5990
            },
            {
              "id": 1492092945918071000,
              "name": "22 Лаборатория строительных конструкций и механики грунтов",
              "number": "22",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 2600,
              "length": 17670,
              "width": 5930
            },
            {
              "id": 1492153967635861800,
              "name": "12 Лаборатория механических испытаний",
              "number": "12",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 2600,
              "length": 11150,
              "width": 5790
            },
            {
              "id": 1492155177219658000,
              "name": "10 Лаборатория деформации и ползучести",
              "number": "10",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 2600,
              "length": 5780,
              "width": 6090
            },
            {
              "id": 1492155427871265000,
              "name": "8 Лаборатория бетонов",
              "number": "8",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 2600,
              "length": 10830,
              "width": 5760
            },
            {
              "id": 1492155483396510000,
              "name": "6 Лаборатория технологии бетонов",
              "number": "6",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 2600,
              "length": 12320,
              "width": 5850
            },
            {
              "id": 1700641814817403100,
              "name": "26 Лаборатория",
              "number": "26",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 2600,
              "length": 6350,
              "width": 5830
            },
            {
              "id": 1490352157716648200,
              "name": "103 Класс рисунка",
              "number": "103",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3660,
              "length": 5750,
              "width": 5520
            },
            {
              "id": 1490352157720842500,
              "name": "104 Компьютерный класс",
              "number": "104",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3660,
              "length": 5520,
              "width": 6120
            },
            {
              "id": 1490352157742862600,
              "name": "109 Лаборатория теплофизики",
              "number": "109",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3660,
              "length": 2870,
              "width": 5530
            },
            {
              "id": 1490352157750202600,
              "name": "111 Лаборатория строительных материалов",
              "number": "111",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3660,
              "length": 8820,
              "width": 5600
            },
            {
              "id": 1490352157760688400,
              "name": "113 Кабинет архитектурно-строительного проектирования",
              "number": "113",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3660,
              "length": 5970,
              "width": 5480
            },
            {
              "id": 1490353917944402200,
              "name": "200 Компьютерный класс",
              "number": "200",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 5750,
              "width": 6070
            },
            {
              "id": 1490353917950693600,
              "name": "201 Учебная аудитория",
              "number": "201",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 5660,
              "width": 5460
            },
            {
              "id": 1490353917954888000,
              "name": "202 Учебная аудитория",
              "number": "202",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 14200,
              "width": 5540
            },
            {
              "id": 1490353917971665200,
              "name": "206 Компьютерный класс, тестирование специалистов-строителей",
              "number": "206",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 8550,
              "width": 5520
            },
            {
              "id": 1490353917989491000,
              "name": "210 Компьютерный класс",
              "number": "210",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 8410,
              "width": 5470
            },
            {
              "id": 1490353918002073900,
              "name": "213 Компьютерный класс",
              "number": "213",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 8660,
              "width": 5310
            },
            {
              "id": 1490353918007316700,
              "name": "214 Аудитория",
              "number": "214",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 6120,
              "width": 5480
            },
            {
              "id": 1490353918015705300,
              "name": "216 Аудитория",
              "number": "216",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 5450,
              "width": 5480
            },
            {
              "id": 1490353918025142500,
              "name": "218 Аудитория",
              "number": "218",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 8660,
              "width": 5470
            },
            {
              "id": 1490353918029336800,
              "name": "219 Компьютерный класс",
              "number": "219",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 8700,
              "width": 5520
            },
            {
              "id": 1490353918039822600,
              "name": "221 Аудитория",
              "number": "221",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 8670,
              "width": 5550
            },
            {
              "id": 1492181318812832000,
              "name": "220а Аудитория",
              "number": "220а",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3050,
              "length": 3000,
              "width": 3460
            },
            {
              "id": 1490356052340773000,
              "name": "301 Учебная  аудитория",
              "number": "301",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8740,
              "width": 5510
            },
            {
              "id": 1490356052346016000,
              "name": "302 Компьютерный класс",
              "number": "302",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8680,
              "width": 5500
            },
            {
              "id": 1490356052350210300,
              "name": "303 Кабинет геологии",
              "number": "303",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8680,
              "width": 5520
            },
            {
              "id": 1490356052369084700,
              "name": "307 Класс живописи",
              "number": "307",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 5570,
              "width": 5550
            },
            {
              "id": 1490356052374327600,
              "name": "308 Лаборатория общей химической технологии и технологии НВ",
              "number": "308",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 11900,
              "width": 5490
            },
            {
              "id": 1490356052378521900,
              "name": "309 Кабинет для самостоятельной работы (магистры и аспиранты)",
              "number": "309",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 2680,
              "width": 5500
            },
            {
              "id": 1490356052383764700,
              "name": "310 Лаборатория инструментальных методов анализа",
              "number": "310",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 5870,
              "width": 5480
            },
            {
              "id": 1490356052387959000,
              "name": "311 Учебная аудитория",
              "number": "311",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 11770,
              "width": 5540
            },
            {
              "id": 1490356052393202000,
              "name": "312 Аудитория",
              "number": "312",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 17600,
              "width": 5520
            },
            {
              "id": 1490356052402639000,
              "name": "314 Учебная аудитория",
              "number": "314",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 17440,
              "width": 5510
            },
            {
              "id": 1490356052419416300,
              "name": "318 Учебная аудитория",
              "number": "318",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 5590,
              "width": 5500
            },
            {
              "id": 1490356052426756400,
              "name": "320 Макетная мастерская кафедры ДАС",
              "number": "320",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 2590,
              "width": 5470
            },
            {
              "id": 1490356052431999200,
              "name": "321 Методический кабинет магистерской подготовки",
              "number": "321",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 10480,
              "width": 2530
            },
            {
              "id": 1700649123946819800,
              "name": "Кабинет",
              "number": "316а",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 2640,
              "width": 5490
            },
            {
              "id": 1700649168941216000,
              "name": "Кабинет",
              "number": "316б",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 3210,
              "width": 5490
            },
            {
              "id": 1700649246347096300,
              "name": "Кабинет",
              "number": "320а",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 3050,
              "width": 5580
            },
            {
              "id": 1490364153819304200,
              "name": "401 Кабинет инженерной геодезии",
              "number": "401",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 14650,
              "width": 5460
            },
            {
              "id": 1490364153823498500,
              "name": "402 Компьютерный класс",
              "number": "402",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8660,
              "width": 5400
            },
            {
              "id": 1490364153830838500,
              "name": "404 Учебная аудитория",
              "number": "404",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 9110,
              "width": 5490
            },
            {
              "id": 1490364153835032800,
              "name": "405 Учебная аудитория",
              "number": "405",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 5680,
              "width": 5600
            },
            {
              "id": 1490364153842372900,
              "name": "407 Лаборатория химических, физических и физико-химических исследований",
              "number": "407",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8220,
              "width": 5500
            },
            {
              "id": 1490364153849713000,
              "name": "409 Лаборатория аналитической химии, ФХМА и идентификации веществ",
              "number": "409",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 9160,
              "width": 5500
            },
            {
              "id": 1490364153852858600,
              "name": "410 Лаборатория общей и неорганической химии",
              "number": "410",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8750,
              "width": 5550
            },
            {
              "id": 1490364153860198700,
              "name": "412 Лаборатория рентгеноструктурного анализа кафедры строительства им. В.С.Грызлова",
              "number": "412",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 6270,
              "width": 5500
            },
            {
              "id": 1490364153864393000,
              "name": "413 Северная аудитория",
              "number": "413",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 17530,
              "width": 5460
            },
            {
              "id": 1490364153868587300,
              "name": "414 Южная аудитория",
              "number": "414",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 17530,
              "width": 5460
            },
            {
              "id": 1490364153894801700,
              "name": "421 Лаборатория физической и коллоидной химии",
              "number": "421",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8720,
              "width": 5550
            },
            {
              "id": 1490364153897947400,
              "name": "422 Компьютерный класс, кабинет курсового и дипломного проектирования",
              "number": "422",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8820,
              "width": 5530
            },
            {
              "id": 1490364153909481700,
              "name": "425 Лаборатория ПАХТ, гидравлики и теплотехники",
              "number": "425",
              "buildName": "Учебно-лабораторный корпус № 2 (Победы, 12)",
              "buildId": 1484669119576937500,
              "height": 3100,
              "length": 8430,
              "width": 5480
            },
            {
              "id": 1492356729759863000,
              "name": "7 Лаборатория",
              "number": "7",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 1920,
              "length": 4540,
              "width": 5950
            },
            {
              "id": 1492356824990486800,
              "name": "10 Лаборатория",
              "number": "10",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 1920,
              "length": 10770,
              "width": 5900
            },
            {
              "id": 1490372472041640200,
              "name": "2а Лаборатория металлографических исследований",
              "number": "2а",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 6100,
              "width": 6000
            },
            {
              "id": 1490372523516236000,
              "name": "3а Лаборатория современного электропривода и мехатронных систем",
              "number": "3а",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 10750,
              "width": 6000
            },
            {
              "id": 1490372581715349800,
              "name": "3б Лаборатория моделирования и механических испытаний",
              "number": "3б",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 7550,
              "width": 2800
            },
            {
              "id": 1490372620801020200,
              "name": "3в Лаборатория робототехнических прокатных комплексов",
              "number": "3в",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 7350,
              "width": 5900
            },
            {
              "id": 1490372667269714200,
              "name": "16 Лаборатория гидравлики и гидропневмопривода",
              "number": "16",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 6700,
              "width": 5950
            },
            {
              "id": 1490372720714584300,
              "name": "16а Лаборатория электрометаллургии",
              "number": "16а",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 4500,
              "width": 2940
            },
            {
              "id": 1490372835492761900,
              "name": "17 Лаборатория материаловедения и ТКМ",
              "number": "17",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 10640,
              "width": 5960
            },
            {
              "id": 1490372835498004700,
              "name": "18 Лаборатория \"Подъемно-транспортные, строительные, дорожные машины и оборудование\"",
              "number": "18",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 10760,
              "width": 5960
            },
            {
              "id": 1700714690460381400,
              "name": "16а Лаборатория",
              "number": "16а",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 3760,
              "width": 5950
            },
            {
              "id": 1700714738897252600,
              "name": "24 Лаборатория",
              "number": "24",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3310,
              "length": 2950,
              "width": 2940
            },
            {
              "id": 1490435408621736200,
              "name": "21 Учебная аудитория",
              "number": "21",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3240,
              "length": 1079000,
              "width": 5950
            },
            {
              "id": 1490435408625930500,
              "name": "22 Лаборатория металлургической теплотехники",
              "number": "22",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3240,
              "length": 7048000,
              "width": 5940
            },
            {
              "id": 1490435408634319000,
              "name": "24 Компьютерный класс",
              "number": "24",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3240,
              "length": 7020,
              "width": 5960
            },
            {
              "id": 1490435408638513400,
              "name": "25 Проектная  аудитория",
              "number": "25",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3240,
              "length": 7040,
              "width": 5950
            },
            {
              "id": 1490435742868967700,
              "name": "27а Учебно-методический кабинет кафедры теплоэнергетики и теплотехники",
              "number": "27а",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3240,
              "length": 3520,
              "width": 5920
            },
            {
              "id": 1490435777622970600,
              "name": "27б Компьютерный класс",
              "number": "27б",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3240,
              "length": 7100,
              "width": 5920
            },
            {
              "id": 1490435838350201000,
              "name": "28 Компьютерный класс",
              "number": "28",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3240,
              "length": 3540,
              "width": 5960
            },
            {
              "id": 1490436122605523200,
              "name": "32 Компьютерный класс",
              "number": "32",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 7520,
              "width": 5960
            },
            {
              "id": 1490436122613911800,
              "name": "34 Учебно-методический кабинет кафедры ММиТО",
              "number": "34",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 3450,
              "width": 5940
            },
            {
              "id": 1490436122618106000,
              "name": "35 Учебная аудитория",
              "number": "35",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 13600,
              "width": 5940
            },
            {
              "id": 1490436183451242800,
              "name": "31а Учебно-методический кабинет каф.электроэнергетики и электротехники",
              "number": "31а",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 10810,
              "width": 5940
            },
            {
              "id": 1490436303758561500,
              "name": "35а Учебная аудитория",
              "number": "35а",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 7010,
              "width": 5930
            },
            {
              "id": 1490436425404911900,
              "name": "37  Лаборатория метрологии, стандартизации и сертификации",
              "number": "37",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 7200,
              "width": 2960
            },
            {
              "id": 1492619572869599500,
              "name": "31 Лаборатория  \"Schneider Electric\"",
              "number": "31",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 7160,
              "width": 2960
            },
            {
              "id": 1700718706692059400,
              "name": "Кабинет",
              "number": "11",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 6750,
              "width": 5940
            },
            {
              "id": 1490436480219222300,
              "name": "41 Лаборатория систем управления электроприводов",
              "number": "41",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 10780,
              "width": 5940
            },
            {
              "id": 1490436480224465200,
              "name": "42 Кабинет кристаллографии и минералогии",
              "number": "42",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 6950,
              "width": 5950
            },
            {
              "id": 1490436480234951000,
              "name": "44 Лаборатория металлургических технологий",
              "number": "44",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 7120,
              "width": 5930
            },
            {
              "id": 1490436480239145200,
              "name": "45 Компьютерный класс",
              "number": "45",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 10740,
              "width": 5920
            },
            {
              "id": 1490436480243339500,
              "name": "46 Учебно-методический кабинет каф.ТС и ТБ",
              "number": "46",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 3070,
              "width": 5920
            },
            {
              "id": 1490436480248582400,
              "name": "47 Учебная аудитория",
              "number": "47",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 10810,
              "width": 5930
            },
            {
              "id": 1490436480253825300,
              "name": "48 Лаборатория \"Машины непрерывного транспорта\"",
              "number": "48",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 10800,
              "width": 5940
            },
            {
              "id": 1490436903810371800,
              "name": "51 Учебная аудитория",
              "number": "51",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 10790,
              "width": 5950
            },
            {
              "id": 1490436903814566100,
              "name": "52 Лаборатория  теории механизмов и машин",
              "number": "52",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 10770,
              "width": 5940
            },
            {
              "id": 1490436903818760400,
              "name": "53  Кабинет промышленной безопасности",
              "number": "53",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3210,
              "length": 6700,
              "width": 5930
            },
            {
              "id": 1490436903822954800,
              "name": "54 Компьютерный класс",
              "number": "54",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 10480,
              "width": 5900
            },
            {
              "id": 1490436903827149000,
              "name": "55 Лаборатория  безопасности жизнедеятельности",
              "number": "55",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 10580,
              "width": 5930
            },
            {
              "id": 1490436903835537700,
              "name": "57 Лаборатория технической механики",
              "number": "57",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 10770,
              "width": 5920
            },
            {
              "id": 1490436903840780500,
              "name": "58 Лаборатория  « Конструкция и эксплутационные свойства трансп.машин»",
              "number": "58",
              "buildName": "Учебно-лабораторный корпус № 4 (Дзержинского, 30)",
              "buildId": 1484669348207400000,
              "height": 3250,
              "length": 10770,
              "width": 5930
            },
            {
              "id": 1490440174809649400,
              "name": "36 Аудитория",
              "number": "36",
              "buildName": "Учебно-лабораторный корпус № 8 (Советский пр., 25)",
              "buildId": 1490439577620452400,
              "height": 3500,
              "length": 7180,
              "width": 3530
            },
            {
              "id": 1490349048685662500,
              "name": "802 Учебная аудитория",
              "number": "802",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8720
            },
            {
              "id": 1490349048689856800,
              "name": "803 Компьютерный класс",
              "number": "803",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8740
            },
            {
              "id": 1490349048695099600,
              "name": "804 Учебно-методический ресурсный центр  кафедры ДО",
              "number": "804",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8670
            },
            {
              "id": 1490349048700342500,
              "name": "805 Учебная аудитория",
              "number": "805",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8900
            },
            {
              "id": 1490349048724459800,
              "name": "810 Учебная аудитория",
              "number": "810",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 11770
            },
            {
              "id": 1490349048728654000,
              "name": "811 Центр информационно-образовательных ресурсов",
              "number": "811",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8770
            },
            {
              "id": 1490349048733897000,
              "name": "812 Учебная аудитория",
              "number": "812",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8830
            },
            {
              "id": 1490349048748577000,
              "name": "815 Учебная аудитория",
              "number": "815",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5920,
              "width": 2650
            },
            {
              "id": 1490349048759062800,
              "name": "817 Учебная аудитория",
              "number": "817",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5920,
              "width": 2620
            },
            {
              "id": 1490349048763257000,
              "name": "818 Учебная аудитория",
              "number": "818",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5920,
              "width": 2570
            },
            {
              "id": 1490349048768500000,
              "name": "819 Учебная аудитория",
              "number": "819",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490349048772694300,
              "name": "820 Учебная аудитория",
              "number": "820",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 2740
            },
            {
              "id": 1490349048777937200,
              "name": "821 Учебная аудитория",
              "number": "821",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1490349048783180000,
              "name": "822 Учебная аудитория",
              "number": "822",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8820
            },
            {
              "id": 1490349048787374300,
              "name": "823 Учебная аудитория",
              "number": "823",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5970,
              "width": 3000
            },
            {
              "id": 1490349048791568600,
              "name": "824 Учебная аудитория",
              "number": "824",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8850
            },
            {
              "id": 1490349048795763000,
              "name": "825 Учебная аудитория",
              "number": "825",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8840
            },
            {
              "id": 1490349048799957200,
              "name": "826 Учебная аудитория",
              "number": "826",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490349048805200100,
              "name": "827 Компьютерный класс",
              "number": "827",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490349048808345900,
              "name": "828 Учебная аудитория",
              "number": "828",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8830
            },
            {
              "id": 1490349048812540200,
              "name": "829 Учебная аудитория",
              "number": "829",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1490349048817783000,
              "name": "830 Учебная аудитория",
              "number": "830",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 3770
            },
            {
              "id": 1671133117620949200,
              "name": "спортивный комплекс №1",
              "number": "1",
              "buildName": "Спортивный комплекс \"Университетский\" (ул. Труда, 3)",
              "buildId": 1490442417495610400,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1490347923942150400,
              "name": "702 Учебная аудитория",
              "number": "702",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8740
            },
            {
              "id": 1490347923946344700,
              "name": "703 Учебная аудитория",
              "number": "703",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2850
            },
            {
              "id": 1490347923949490400,
              "name": "704 Кабинет диалектологии и краеведения",
              "number": "704",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2850
            },
            {
              "id": 1490347923953684700,
              "name": "705 Учебно-методический кабинет кафедры ОФиПК",
              "number": "705",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8720
            },
            {
              "id": 1490347923956830500,
              "name": "706 Учебная аудитория",
              "number": "706",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8680
            },
            {
              "id": 1490347923959976200,
              "name": "707 Учебная аудитория",
              "number": "707",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8830
            },
            {
              "id": 1490347923964170500,
              "name": "708 Учебная аудитория",
              "number": "708",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2900
            },
            {
              "id": 1490347923979899100,
              "name": "712 Учебно-методический кабинет кафедры ГФиМК",
              "number": "712",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8770
            },
            {
              "id": 1490347923984093400,
              "name": "713 Учебная аудитория",
              "number": "713",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8830
            },
            {
              "id": 1490347924001919200,
              "name": "717 Лаборатория анатомии и физиологии человека",
              "number": "717",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8830
            },
            {
              "id": 1490347924006113500,
              "name": "718 Лаборатория биохимии и физиологии растений и микроорганизмов",
              "number": "718",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490347924011356400,
              "name": "719 Кабинет тактико-специальной  (специальной профессиональной) подготовки",
              "number": "719",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 11720
            },
            {
              "id": 1490347924016599300,
              "name": "720 Учебно-методический кабинет, учебно-методический ресурсный центр              кафедры НООиСП",
              "number": "720",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 9080
            },
            {
              "id": 1490347924020793600,
              "name": "721 Лаборатория ботаники",
              "number": "721",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1490347924050153700,
              "name": "723 Лаборатория зоологии",
              "number": "723",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8780
            },
            {
              "id": 1490347924055396600,
              "name": "724 Учебная аудитория",
              "number": "724",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 11750
            },
            {
              "id": 1490347924065882400,
              "name": "726 Лаборатория экологии",
              "number": "726",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1490347924070076700,
              "name": "727 Учебно-исследовательская лаборатория, преподавательская",
              "number": "727",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8860
            },
            {
              "id": 1490347924074271000,
              "name": "728 Учебно-методический кабинет кафедры биологии",
              "number": "728",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 3840
            },
            {
              "id": 1492794207908139300,
              "name": "214",
              "number": "214",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492794930937991400,
              "name": "215",
              "number": "215",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492794967740911900,
              "name": "216",
              "number": "216",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492795087890944300,
              "name": "217",
              "number": "217",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492795821227250000,
              "name": "204",
              "number": "204",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492795861098303700,
              "name": "205",
              "number": "205",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492795893434290400,
              "name": "206",
              "number": "206",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492795937044566300,
              "name": "207",
              "number": "207",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492796047880098000,
              "name": "208",
              "number": "208",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492796084514197800,
              "name": "209",
              "number": "209",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492796129310413000,
              "name": "210",
              "number": "210",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492796238597198000,
              "name": "211",
              "number": "211",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492805034838069500,
              "name": "310",
              "number": "310",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808120650436900,
              "name": "311",
              "number": "311",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808159299899600,
              "name": "312",
              "number": "312",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808193797001500,
              "name": "313",
              "number": "313",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808229907861800,
              "name": "314",
              "number": "314",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808265224950000,
              "name": "315",
              "number": "315",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808751372046600,
              "name": "303",
              "number": "303",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808787211325700,
              "name": "304",
              "number": "304",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808821804896500,
              "name": "305",
              "number": "305",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808858948604200,
              "name": "306",
              "number": "306",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1492808892042711300,
              "name": "307",
              "number": "307",
              "buildName": "Учебный корпус № 3 (ул. М. Горького, 12)",
              "buildId": 1490442763313878000,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1490346292918882600,
              "name": "603 Учебно-методический кабинет",
              "number": "603",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490346292923076900,
              "name": "604 Класс психологического консультирования",
              "number": "604",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490346292930417000,
              "name": "606 Учебный класс для проведения психологических тренингов",
              "number": "606",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 5700
            },
            {
              "id": 1490346292933562600,
              "name": "607 Учебная аудитория",
              "number": "607",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 6120
            },
            {
              "id": 1490346292937757000,
              "name": "608 Класс психодиагностики. Специализированный компьютерный класс",
              "number": "608",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8750
            },
            {
              "id": 1490346292948242700,
              "name": "611 Компьютерный класс, лингафонный кабинет",
              "number": "611",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8900
            },
            {
              "id": 1490346292951388400,
              "name": "612 Учебная аудитория",
              "number": "612",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2900
            },
            {
              "id": 1490346292955582700,
              "name": "613 Кабинет физики",
              "number": "613",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8870
            },
            {
              "id": 1490346292966068500,
              "name": "614 Компьютерный класс",
              "number": "614",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1490346292969214200,
              "name": "615 Лаборатория информатики, технологий и методов программирования",
              "number": "615",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8680
            },
            {
              "id": 1490346292973408500,
              "name": "616 Учебная аудитория. Компьютерный класс",
              "number": "616",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1490346292984942800,
              "name": "619 Учебная аудитория. Компьютерный класс",
              "number": "619",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 9150
            },
            {
              "id": 1490346293000671500,
              "name": "621 Кабинет для самостоятельной работы",
              "number": "621",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2850
            },
            {
              "id": 1490346293006963000,
              "name": "622 Кабинет профилактического обслуживания оборудования",
              "number": "622",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2860
            },
            {
              "id": 1490346293012205800,
              "name": "623 Лаборатория электротехники, электроники и схемотехники. Лаборатория технической защиты информации.",
              "number": "623",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 11900
            },
            {
              "id": 1490346293016400100,
              "name": "624 Исследовательская лаборатория",
              "number": "624",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 3090
            },
            {
              "id": 1490346293021643000,
              "name": "625 Лаборатория сетей и системы защиты информации",
              "number": "625",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8670
            },
            {
              "id": 1490346293025837300,
              "name": "626 Лаборатория программно-аппаратных средств",
              "number": "626",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8880
            },
            {
              "id": 1490346293031080200,
              "name": "627 Учебная аудитория",
              "number": "627",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 5980,
              "width": 2880
            },
            {
              "id": 1490346293036323000,
              "name": "628 Учебная аудитория",
              "number": "628",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8760
            },
            {
              "id": 1492720435982242000,
              "name": "б/н Студенческий инженерный центр по проектированию и изготовлению инновационных скоростных транспортных средств",
              "number": "б/н  территория уч.корпуса №8",
              "buildName": "Гаражи для спецмашин - учебная лаборатория диагностики автотранспорта 1 (Сов. 25)",
              "buildId": 1492634331675366400,
              "height": 2110,
              "length": 11670,
              "width": 5710
            },
            {
              "id": 1493343626573386000,
              "name": "Спортзал",
              "number": "1/4",
              "buildName": "Спортивный корпус (ул.Труда,д.3)",
              "buildId": 1492901605554525200,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1493343766850834700,
              "name": "Кабинет",
              "number": "1/6",
              "buildName": "Спортивный корпус (ул.Труда,д.3)",
              "buildId": 1492901605554525200,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1493447465095926000,
              "name": "Спортзал",
              "number": "8",
              "buildName": "Стрелковый тир (ул.Труда, д.3)",
              "buildId": 1492901989869163500,
              "height": 3200,
              "length": 6000,
              "width": 10080
            },
            {
              "id": 1493448027080233200,
              "name": "11 Учебно-методический кабинет",
              "number": "11",
              "buildName": "Стрелковый тир (ул.Труда, д.3)",
              "buildId": 1492901989869163500,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1493448447601152300,
              "name": "Спортзал",
              "number": "24",
              "buildName": "Стрелковый тир (ул.Труда, д.3)",
              "buildId": 1492901989869163500,
              "height": 3200,
              "length": 13530,
              "width": 5980
            },
            {
              "id": 1493448489813676300,
              "name": "Спортзал",
              "number": "25",
              "buildName": "Стрелковый тир (ул.Труда, д.3)",
              "buildId": 1492901989869163500,
              "height": 3200,
              "length": 16050,
              "width": 12300
            },
            {
              "id": 1493515861911146800,
              "name": "Спортзал",
              "number": "14",
              "buildName": "Спортивный комплекс \"Университетский\" (ул.Труда, д.3)",
              "buildId": 1492902731193521200,
              "height": 8340,
              "length": 42360,
              "width": 18370
            },
            {
              "id": 1490345253992927500,
              "name": "502 Лаборатория социологических исследований",
              "number": "502",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490345253998170400,
              "name": "503 Учебно-методический кабинет каф.социологии и соц.технологий",
              "number": "503",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1490345254003413200,
              "name": "504 Компьютерный класс",
              "number": "504",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8730
            },
            {
              "id": 1490345254013899000,
              "name": "506 Учебная аудитория",
              "number": "506",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 6160
            },
            {
              "id": 1490345254019142000,
              "name": "507 Учебная аудитория",
              "number": "507",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 6160
            },
            {
              "id": 1490345254028579000,
              "name": "509 Учебная аудитория",
              "number": "509",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8850
            },
            {
              "id": 1490345254033822000,
              "name": "510 Кабинет огневой подготовки",
              "number": "510",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8830
            },
            {
              "id": 1490345254038016300,
              "name": "511  Учебно-методический кабинет кафедры иностранных языков, преподавательская",
              "number": "511",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5720,
              "width": 6000
            },
            {
              "id": 1490345254043259100,
              "name": "512 Лаборатория молекулярной физики",
              "number": "512",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8880
            },
            {
              "id": 1490345254047453400,
              "name": "513 Учебная аудитория",
              "number": "513",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1490345254052696300,
              "name": "514 Учебная аудитория",
              "number": "514",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8650
            },
            {
              "id": 1490345254056890600,
              "name": "515 Лаборатория механики",
              "number": "515",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8820
            },
            {
              "id": 1490345254066327800,
              "name": "517 Лаборатория  физики",
              "number": "517",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 8900
            },
            {
              "id": 1490345254075765000,
              "name": "519 Учебная аудитория",
              "number": "519",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 5830
            },
            {
              "id": 1490345254079959300,
              "name": "520 Учебная аудитория",
              "number": "520",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5950,
              "width": 11920
            },
            {
              "id": 1490345254090445000,
              "name": "522 Компьютерный класс",
              "number": "522",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5950,
              "width": 8920
            },
            {
              "id": 1490345254094639400,
              "name": "523 Учебно-методический кабинет КФС",
              "number": "523",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5980,
              "width": 2870
            },
            {
              "id": 1490345254099882200,
              "name": "524 Учебная аудитория",
              "number": "524",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5950,
              "width": 8880
            },
            {
              "id": 1490345254110368000,
              "name": "526 Лаборатория нанотехнологий",
              "number": "526",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 5950,
              "width": 8770
            },
            {
              "id": 1671012713497629000,
              "name": "501б Проектная аудитория",
              "number": "501б",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 12020
            },
            {
              "id": 1488379776402985200,
              "name": "401 Учебно-методический кабинет кафедры ПиТО, зав.кафедрой",
              "number": "401",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6020,
              "width": 6190
            },
            {
              "id": 1488379776407179500,
              "name": "402 Учебная аудитория. Компьютерный класс",
              "number": "402",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 14700
            },
            {
              "id": 1488379776413471000,
              "name": "404 Лаборатория механики и художественной обработки материалов",
              "number": "404",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8680
            },
            {
              "id": 1488379776416616700,
              "name": "405 Лаборатория материаловедения и технологии обработки материалов",
              "number": "405",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8830
            },
            {
              "id": 1488379776422908200,
              "name": "407 Компьютерный класс",
              "number": "407",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 9080
            },
            {
              "id": 1488379776429199600,
              "name": "409 Учебная аудитория",
              "number": "409",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8880
            },
            {
              "id": 1488379776432345300,
              "name": "410 Учебная аудитория",
              "number": "410",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 8780,
              "width": 6000
            },
            {
              "id": 1488379776435491000,
              "name": "411 Лаборатория радиофизики",
              "number": "411",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8880
            },
            {
              "id": 1488379776438636800,
              "name": "412 Лаборатория физической электроники",
              "number": "412",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1488379776441782500,
              "name": "413 Лаборатория электричества и магнетизма",
              "number": "413",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8680
            },
            {
              "id": 1488379776444928300,
              "name": "414 Учебная аудитория",
              "number": "414",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 11750
            },
            {
              "id": 1488379776448074000,
              "name": "415 Учебный зал судебных заседаний",
              "number": "415",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 12150
            },
            {
              "id": 1488379776451219700,
              "name": "416 Компьютерный класс",
              "number": "416",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 5970,
              "width": 8830
            },
            {
              "id": 1488379776462754000,
              "name": "418 Компьютерный класс",
              "number": "418",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8920
            },
            {
              "id": 1488379776466948400,
              "name": "419 Лаборатория квантовой радиофизики",
              "number": "419",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2900
            },
            {
              "id": 1488379776470094000,
              "name": "420 Лаборатория оптики",
              "number": "420",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1488379776473239800,
              "name": "421 Лаборатория оптики",
              "number": "421",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8700
            },
            {
              "id": 1488379776483725600,
              "name": "424 Компьютерный класс",
              "number": "424",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8770
            },
            {
              "id": 1492166541423153400,
              "name": "114 Эколого-аналитическая лаборатория",
              "number": "114",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 0,
              "width": 0
            },
            {
              "id": 1488372624594571500,
              "name": "310 Учебно-методический кабинет",
              "number": "310",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 5970,
              "width": 2700
            },
            {
              "id": 1488372624604008700,
              "name": "312 Учебно-методический кабинет",
              "number": "312",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 5970,
              "width": 2800
            },
            {
              "id": 1488372624613446000,
              "name": "315 Учебная аудитория",
              "number": "315",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 2930
            },
            {
              "id": 1488372624626028800,
              "name": "319 Компьютерный класс, лингафонный кабинет, медиазал",
              "number": "319",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 8920
            },
            {
              "id": 1488372624631271700,
              "name": "320 Компьютерный класс",
              "number": "320",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 8730
            },
            {
              "id": 1488372624634417400,
              "name": "321 Кабинет предметно-методической подготовки и декоративно-прикладного искусства",
              "number": "321",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 8720
            },
            {
              "id": 1488372624637563100,
              "name": "322 Компьютерный класс",
              "number": "322",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 8710
            },
            {
              "id": 1488372624640708900,
              "name": "323 Учебно-методический ресурсный центр",
              "number": "323",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 2850
            },
            {
              "id": 1488372624643854600,
              "name": "324 Кабинет  графики, композиции, рисунка и живописи",
              "number": "324",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 12120
            },
            {
              "id": 1488372624649097500,
              "name": "325 компьютерный класс",
              "number": "325",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 5940,
              "width": 8830
            },
            {
              "id": 1488372624656437500,
              "name": "327а Компьютерный класс",
              "number": "327а",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 5800
            },
            {
              "id": 1488372624659583200,
              "name": "328 Лаборатория  интеллектуальных систем и датчиков",
              "number": "328",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 11550
            },
            {
              "id": 1488372624670069000,
              "name": "331 Учебная аудитория",
              "number": "331",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 11800
            },
            {
              "id": 1488379290380669200,
              "name": "327б Лаборатория технических средств автоматизации",
              "number": "327б",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 5890
            },
            {
              "id": 1492080565002703000,
              "name": "318 Медиа-лаборатория",
              "number": "318",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6000,
              "width": 5860
            },
            {
              "id": 1492089330440606000,
              "name": "302 Проектная аудитория",
              "number": "302",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6020,
              "width": 5820
            },
            {
              "id": 1671012457577976000,
              "name": "301а Проектная аудитория",
              "number": "301а",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6020,
              "width": 6000
            },
            {
              "id": 1671012499597562000,
              "name": "301б Проектная аудитория",
              "number": "301б",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6020,
              "width": 6000
            },
            {
              "id": 1671012553029849300,
              "name": "301в  Проектная аудитория",
              "number": "301в",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6040,
              "width": 3030
            },
            {
              "id": 1671012604089209000,
              "name": "301г Проектная аудитория",
              "number": "301г",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3050,
              "length": 6020,
              "width": 3180
            },
            {
              "id": 1488365888710119700,
              "name": "201 Учебная аудитория",
              "number": "201",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 11620,
              "width": 12080
            },
            {
              "id": 1488365888715362600,
              "name": "202 Учебная аудитория",
              "number": "202",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 11750,
              "width": 11630
            },
            {
              "id": 1488365888719556900,
              "name": "203 Учебная аудитория",
              "number": "203",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 11830,
              "width": 11630
            },
            {
              "id": 1488365888722702600,
              "name": "204 Учебная аудитория",
              "number": "204",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 11630,
              "width": 11700
            },
            {
              "id": 1488365888726897000,
              "name": "205 Учебная  аудитория",
              "number": "205",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 11630,
              "width": 12000
            },
            {
              "id": 1488366378592244000,
              "name": "212 Лаборатория микроэлектроники и схемотехники  ЭВМ",
              "number": "212",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 8050,
              "width": 5600
            },
            {
              "id": 1488366378618458400,
              "name": "215 Учебно-методический кабинет кафедры МПО ЭВМ",
              "number": "215",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 2930,
              "width": 6000
            },
            {
              "id": 1488366378633138400,
              "name": "217 Компьютерный класс",
              "number": "217",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8750
            },
            {
              "id": 1488366378640478500,
              "name": "218 Компьютерный класс",
              "number": "218",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8730
            },
            {
              "id": 1488366378649915600,
              "name": "219 Компьютерный класс",
              "number": "219",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8800
            },
            {
              "id": 1488366378664595700,
              "name": "221 Учебная аудитория, компьютерный класс",
              "number": "221",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 12120
            },
            {
              "id": 1488366378671935700,
              "name": "222 Лаборатория рентгеноструктурного анализа им.Н.А.Ёрохова",
              "number": "222",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 5900,
              "width": 5960
            },
            {
              "id": 1488366378679275800,
              "name": "223 Лаборатория физики атомного ядра",
              "number": "223",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 0,
              "width": 8900
            },
            {
              "id": 1488366378695004400,
              "name": "225 Лаборатория оптических методов исследования твердого тела",
              "number": "225",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2900
            },
            {
              "id": 1488366378702344400,
              "name": "226 Лаборатория физики металлического состояния",
              "number": "226",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 2860
            },
            {
              "id": 1488366378709684500,
              "name": "227 Лаборатория мобильных программных систем и технологий",
              "number": "227",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8840
            },
            {
              "id": 1488366378724364500,
              "name": "228 Лаборатория Multi- D моделирования.Лаборатория распределенных и высокопроизводительных вычислительных систем",
              "number": "228",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8820
            },
            {
              "id": 1488366378744287500,
              "name": "229 Компьютерный класс",
              "number": "229",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6000,
              "width": 8880
            },
            {
              "id": 1488366378767356200,
              "name": "231 Лаборатория систем искусственного интеллекта",
              "number": "231",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 0,
              "width": 0
            },
            {
              "id": 1488369326572441900,
              "name": "218а Компьютерный класс",
              "number": "218а",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 6460,
              "width": 5600
            },
            {
              "id": 1492072375260287200,
              "name": "111 Лаборатория нестерильной пробоподготовки",
              "number": "111",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 3000,
              "length": 0,
              "width": 0
            },
            {
              "id": 1487105832995787000,
              "name": "105 лаборатория атомно-абсорбционной спектрометрии",
              "number": "105",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 3050
            },
            {
              "id": 1487105833005224200,
              "name": "108 Палеонтологическая лаборатория",
              "number": "108",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6020,
              "width": 17670
            },
            {
              "id": 1487105833010467000,
              "name": "110 Лаборатория IRMS",
              "number": "110",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 6000,
              "width": 6860
            },
            {
              "id": 1492000351771955500,
              "name": "100 Лаборатория психофизиологии",
              "number": "100",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 2950,
              "length": 2950,
              "width": 2500
            },
            {
              "id": 1743837688974143700,
              "name": "109 Лаборатория прикладной биотехнологии",
              "number": "109",
              "buildName": "Учебно-лабораторный корпус № 1 (Советский, 8)",
              "buildId": 1484668639063839700,
              "height": 0,
              "length": 0,
              "width": 0
            },
            {
              "id": 1490441475689812200,
              "name": "201 Инжиниринговый центр компьютерного моделирования",
              "number": "201",
              "buildName": "Учебно-лабораторный корпус № 5 (Луначарского, 5А)",
              "buildId": 1471886587531891700,
              "height": 3800,
              "length": 10910,
              "width": 6260
            },
            {
              "id": 1490441475706589400,
              "name": "203 Исследовательский центр искусственного  интеллекта и андроидной педагогики",
              "number": "203",
              "buildName": "Учебно-лабораторный корпус № 5 (Луначарского, 5А)",
              "buildId": 1471886587531891700,
              "height": 3800,
              "length": 10540,
              "width": 6340
            },
            {
              "id": 1490441475713929500,
              "name": "204 СКБ \"Мир\"",
              "number": "204",
              "buildName": "Учебно-лабораторный корпус № 5 (Луначарского, 5А)",
              "buildId": 1471886587531891700,
              "height": 3800,
              "length": 14100,
              "width": 6340
            },
            {
              "id": 1490441117992227000,
              "name": "101 Производственная лаборатория",
              "number": "101",
              "buildName": "Учебно-лабораторный корпус № 5 (Луначарского, 5А)",
              "buildId": 1471886587531891700,
              "height": 3620,
              "length": 10900,
              "width": 6290
            },
            {
              "id": 1490441118002712800,
              "name": "103 Конференц-зал",
              "number": "103",
              "buildName": "Учебно-лабораторный корпус № 5 (Луначарского, 5А)",
              "buildId": 1471886587531891700,
              "height": 3620,
              "length": 10560,
              "width": 6400
            },
            {
              "id": 1490441118038364400,
              "name": "109 Инжиниринговый центр автоматики и промышленной робототехники",
              "number": "109",
              "buildName": "Учебно-лабораторный корпус № 5 (Луначарского, 5А)",
              "buildId": 1471886587531891700,
              "height": 3620,
              "length": 7200,
              "width": 6270
            },
            {
              "id": 1491982414359040300,
              "name": "306 Репитиционный класс",
              "number": "306",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3400,
              "length": 5940,
              "width": 10950
            },
            {
              "id": 1490443018157691100,
              "name": "203 Учебная аудитория",
              "number": "203",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3200,
              "length": 5780,
              "width": 10570
            },
            {
              "id": 1490443092904382700,
              "name": "205  Конференц-зал",
              "number": "205",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3200,
              "length": 5860,
              "width": 11910
            },
            {
              "id": 1490443139895267600,
              "name": "216 Брекаут",
              "number": "216",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3200,
              "length": 7920,
              "width": 5820
            },
            {
              "id": 1490443179404562700,
              "name": "217 Брекаут",
              "number": "217",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3200,
              "length": 7970,
              "width": 5820
            },
            {
              "id": 1491718599420678400,
              "name": "207 Служба комплексной безопасности",
              "number": "207",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3200,
              "length": 5900,
              "width": 2550
            },
            {
              "id": 1491721535614882000,
              "name": "215 Брекаут",
              "number": "215",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3200,
              "length": 8000,
              "width": 5840
            },
            {
              "id": 1490442947335819500,
              "name": "101 Учебная аудитория. Студенческий пресс-центр",
              "number": "101",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3400,
              "length": 5820,
              "width": 9000
            },
            {
              "id": 1491703540390826200,
              "name": "118 Абонемент",
              "number": "118",
              "buildName": "Учебно-лабораторный корпус № 3 (ул.М.Горького, 14)",
              "buildId": 1471886253797414000,
              "height": 3400,
              "length": 5870,
              "width": 19320
            },
            {
              "id": 1490439059959452000,
              "name": "401 Компьютерный класс",
              "number": "401",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3200,
              "length": 11490,
              "width": 6020
            },
            {
              "id": 1490439059985666300,
              "name": "407 Кабинет магистерской подготовки",
              "number": "407",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3200,
              "length": 4930,
              "width": 6080
            },
            {
              "id": 1490439059993006300,
              "name": "409 Учебная аудитория",
              "number": "409",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3200,
              "length": 8280,
              "width": 6040
            },
            {
              "id": 1490439060005589200,
              "name": "412 Компьютерный класс",
              "number": "412",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3200,
              "length": 11410,
              "width": 6210
            },
            {
              "id": 1490438777520263400,
              "name": "301 Учебная аудитория, компьютерный класс",
              "number": "301",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3000,
              "length": 11450,
              "width": 6020
            },
            {
              "id": 1490438777526555000,
              "name": "302 Учебная аудитория, кабинет медико-биологических дисциплин",
              "number": "302",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3000,
              "length": 5840,
              "width": 5990
            },
            {
              "id": 1490438777530749200,
              "name": "303 Лаборатория",
              "number": "303",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3000,
              "length": 2280,
              "width": 6050
            },
            {
              "id": 1490438777542283500,
              "name": "306 Учебная аудитория",
              "number": "306",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3000,
              "length": 5510,
              "width": 6060
            },
            {
              "id": 1490438777550672100,
              "name": "308 Учебная аудитория",
              "number": "308",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3000,
              "length": 8030,
              "width": 6100
            },
            {
              "id": 1490438777561158000,
              "name": "311 Учебная аудитория",
              "number": "311",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3000,
              "length": 11370,
              "width": 6260
            },
            {
              "id": 1471774257598959900,
              "name": "201 Лаборатория финансовых вычислений",
              "number": "201",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3050,
              "length": 11430,
              "width": 6050
            },
            {
              "id": 1490437674469691600,
              "name": "202 Учебная аудитория",
              "number": "202",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3050,
              "length": 8210,
              "width": 5950
            },
            {
              "id": 1490437674475983000,
              "name": "203 Учебная аудитория",
              "number": "203",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3050,
              "length": 8230,
              "width": 5990
            },
            {
              "id": 1490437674480177400,
              "name": "204 Учебная аудитория",
              "number": "204",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3050,
              "length": 8090,
              "width": 6040
            },
            {
              "id": 1490437674499051800,
              "name": "208 Центр деловых игр",
              "number": "208",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3050,
              "length": 11410,
              "width": 6230
            },
            {
              "id": 1490437243326697700,
              "name": "102 РУМЦ СЗФО ЧГУ. Call-центр. Центр специальных технических средств обучения.",
              "number": "102",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3100,
              "length": 9440,
              "width": 6000
            },
            {
              "id": 1490437243336135000,
              "name": "104 Учебная аудитория",
              "number": "104",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3100,
              "length": 8150,
              "width": 6060
            },
            {
              "id": 1490437243340329200,
              "name": "105 Конференц-зал",
              "number": "105",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3100,
              "length": 16510,
              "width": 6050
            },
            {
              "id": 1490437243353960700,
              "name": "108 Учебная аудитория. Медиазал.",
              "number": "108",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3100,
              "length": 11430,
              "width": 6240
            },
            {
              "id": 1490437304943120600,
              "name": "101а Лаборатория функциональной диагностики и реабилитации РУМЦ СЗФО ЧГУ",
              "number": "101а",
              "buildName": "Учебно-лабораторный корпус № 6 (Советский, 10)",
              "buildId": 1471771374063195100,
              "height": 3270,
              "length": 5800,
              "width": 5500
            },
            {
              "id": 1492811258034917600,
              "name": "Бассейн",
              "number": "15",
              "buildName": "Спортивно-оздоровительный комплекс (ул.Чкалова, 31А)",
              "buildId": 1491457877710214100,
              "height": 3100,
              "length": 0,
              "width": 10470
            },
            {
              "id": 1492811819195044000,
              "name": "Спортзал",
              "number": "25",
              "buildName": "Спортивно-оздоровительный комплекс (ул.Чкалова, 31А)",
              "buildId": 1491457877710214100,
              "height": 6800,
              "length": 23460,
              "width": 11560
            }
          ]
    ),
}

const mockErrResponse: Response = {
    text: () =>
      Promise.resolve(
        `{
            "code": 403,
            "status": "FORBIDDEN",
            "description": "Token is not valid"
          }`,
      ),
    headers: headers,
    ok: true,
    redirected: false,
    status: 200,
    statusText: 'Ok',
    type: 'default',
    url: 'testURL',
    clone: () => {
      return mockErrResponse
    },
    body: null,
    bodyUsed: true,
    arrayBuffer: () =>
      new Promise<ArrayBuffer>((resolve) => {
        resolve(new ArrayBuffer(8))
      }),
    blob: () =>
      new Promise<Blob>((resolve) => {
        resolve(new Blob())
      }),
    formData: () =>
      new Promise<FormData>((resolve) => {
        let f: FormData = new FormData()
        resolve(f)
      }),
    json: () => Promise.resolve(
        {
            "code": 403,
            "status": "FORBIDDEN",
            "description": "Token is not valid"
        }
    ),
}

const mockUndResponse: Response = {
    text: () =>Promise.resolve(`<!DOCTYPE HTML>

    <html>
    
        <head>
    
            <meta charset="utf-8">
    
            <link href="/img/favicon.ico" rel="shortcut icon"/>
    
            <meta http-equiv="X-UA-Compatible" content="IE=edge">
    
            <meta name="viewport" content="width=device-width, initial-scale=1.0">
    
            <meta name="description" content="">
    
            <meta name="author" content="">
    
    
    
            <title>Авторизация</title>
    
    
    
            <link rel="stylesheet" type="text/css" href="/css/style.css"/>
    
            <link rel="stylesheet" type="text/css" href="/css/bootstrap.min.css"/>
    
    
    
        </head>
    
    
    
        <body><noscript><meta HTTP-EQUIV="refresh" content="0;url='http://api.chsu.ru/login?PageSpeed=noscript'" /><style><!--table,div,span,font,p{display:none} --></style><div style="display:block">Please click <a href="http://api.chsu.ru/login?PageSpeed=noscript">here</a> if you are not redirected within a few seconds.</div></noscript>
    
    
    
            <div class="container-flex">
    
                <div class="auth-container">
    
                    <div class="header">
    
                        <h1>Пожалуйста авторизуйтесь</h1>
    
                    </div>
    
                    <div class="inner">
    
                        <div class="form">
    
                            
    
                            <form action="perform_login" method="POST">
    
                                <div class="form-group">
    
                                    <input type="text" class="form-control" name="username" placeholder="Login"/>
    
                                </div>
    
                                <div class="form-group">
    
                                    <input type="password" class="form-control" name="password" placeholder="Password"/>
    
                                </div>
    
                                <button class="btn btn-lg btn-primary btn-sm" type="submit">Войти</button>
    
                            </form>
    
                        </div>
    
                    </div>
    
                </div>
    
            </div>
    
        </body>
    
    </html>`),
    headers: headers,
    ok: true,
    redirected: false,
    status: 200,
    statusText: 'Ok',
    type: 'default',
    url: 'testURL',
    clone: () => {
      return mockErrResponse
    },
    body: null,
    bodyUsed: true,
    arrayBuffer: () =>
      new Promise<ArrayBuffer>((resolve) => {
        resolve(new ArrayBuffer(8))
      }),
    blob: () =>
      new Promise<Blob>((resolve) => {
        resolve(new Blob())
      }),
    formData: () =>
      new Promise<FormData>((resolve) => {
        let f: FormData = new FormData()
        resolve(f)
      }),
    json: () => Promise.resolve(JSON.parse(`<!DOCTYPE HTML>

    <html>
    
        <head>
    
            <meta charset="utf-8">
    
            <link href="/img/favicon.ico" rel="shortcut icon"/>
    
            <meta http-equiv="X-UA-Compatible" content="IE=edge">
    
            <meta name="viewport" content="width=device-width, initial-scale=1.0">
    
            <meta name="description" content="">
    
            <meta name="author" content="">
    
    
    
            <title>Авторизация</title>
    
    
    
            <link rel="stylesheet" type="text/css" href="/css/style.css"/>
    
            <link rel="stylesheet" type="text/css" href="/css/bootstrap.min.css"/>
    
    
    
        </head>
    
    
    
        <body><noscript><meta HTTP-EQUIV="refresh" content="0;url='http://api.chsu.ru/login?PageSpeed=noscript'" /><style><!--table,div,span,font,p{display:none} --></style><div style="display:block">Please click <a href="http://api.chsu.ru/login?PageSpeed=noscript">here</a> if you are not redirected within a few seconds.</div></noscript>
    
    
    
            <div class="container-flex">
    
                <div class="auth-container">
    
                    <div class="header">
    
                        <h1>Пожалуйста авторизуйтесь</h1>
    
                    </div>
    
                    <div class="inner">
    
                        <div class="form">
    
                            
    
                            <form action="perform_login" method="POST">
    
                                <div class="form-group">
    
                                    <input type="text" class="form-control" name="username" placeholder="Login"/>
    
                                </div>
    
                                <div class="form-group">
    
                                    <input type="password" class="form-control" name="password" placeholder="Password"/>
    
                                </div>
    
                                <button class="btn btn-lg btn-primary btn-sm" type="submit">Войти</button>
    
                            </form>
    
                        </div>
    
                    </div>
    
                </div>
    
            </div>
    
        </body>
    
    </html>`)),
}
const semafore:{[key:string]:{wait:Promise<void>, fetch:Promise<Response>, end:boolean, onEnd?:()=>void}}={};

function configureSemafore(){
    semafore.normalConn={
        wait:new Promise(resolve=>{
          resolve();
        }),
        fetch:Promise.resolve(mockResponse),
        end:false
    };
    semafore.ErrCon={
        wait:new Promise(resolve=>{
          if(semafore.normalConn){
            semafore.normalConn.onEnd=()=>{
              resolve();
            }            
          }else{
            resolve();
          }
        }),
        fetch:Promise.resolve(mockErrResponse),
        end:false
    };
    semafore.UndCon={
        wait:new Promise(resolve=>{
          if(semafore.ErrCon){
            semafore.ErrCon.onEnd=()=>{
              resolve();
            }            
          }else{
            resolve();
          }
        }),
        fetch:Promise.resolve(mockUndResponse),
        end:false
    };

}

describe('Buildings', ()=>{
    configureSemafore();

    test('normal load', async()=>{
        await semafore.normalConn.wait;
        global.fetch =jest.fn(() =>semafore.normalConn.fetch.then()); 
        await Auditorium.Load();
        semafore.normalConn.end=true; 
        if(semafore.normalConn.onEnd)semafore.normalConn.onEnd();
        expect(Auditorium.Auditories.length).toBe(325);
    })

    test('error connection', async ()=>{        
        await semafore.ErrCon.wait;        
        global.fetch = jest.fn(() => semafore.ErrCon.fetch);
        try{
            await Auditorium.Load();
            throw new Error('test be are incorrect!')
        }catch(er){
            const err=er as any;
            semafore.ErrCon.end=true; 
            if(semafore.ErrCon.onEnd)semafore.ErrCon.onEnd();
            expect(err.message).toBe('Unauthorized (Token is not valid)');
            expect(err['cause']).toStrictEqual({code: 403, description: "Token is not valid", status: "FORBIDDEN"});           
        }
        
        semafore.ErrCon.end=true; 
        if(semafore.ErrCon.onEnd)semafore.ErrCon.onEnd();
    })

    test('error udefinded', async ()=>{        
        await semafore.UndCon.wait;        
        global.fetch = jest.fn(() => semafore.UndCon.fetch);
        try{
            await Auditorium.Load();
            throw new Error('test be are incorrect!')
        }catch(er){
            const err=er as any;
            semafore.UndCon.end=true; 
            if(semafore.UndCon.onEnd)semafore.UndCon.onEnd();
            expect(err.message).toBe('Unauthorized or connection lost!');         
        }
        
        
    })
});
